/* automatically generated by rust-bindgen 0.59.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const SA_NODEFER: u32 = 1073741824;
pub const SA_RESETHAND: u32 = 2147483648;
pub const SA_INTERRUPT: u32 = 536870912;
pub const SA_NOMASK: u32 = 1073741824;
pub const SA_ONESHOT: u32 = 2147483648;
pub const SA_STACK: u32 = 134217728;
pub const SIG_BLOCK: u32 = 0;
pub const SIG_UNBLOCK: u32 = 1;
pub const SIG_SETMASK: u32 = 2;
pub const SV_ONSTACK: u32 = 1;
pub const SV_INTERRUPT: u32 = 2;
pub const SV_RESETHAND: u32 = 4;
pub const _BITS_SIGCONTEXT_H: u32 = 1;
pub const FP_XSTATE_MAGIC1: u32 = 1179670611;
pub const FP_XSTATE_MAGIC2: u32 = 1179670597;
pub const MINSIGSTKSZ: u32 = 2048;
pub const SIGSTKSZ: u32 = 8192;
pub const _SYS_UCONTEXT_H: u32 = 1;
pub const NGREG: u32 = 23;
pub const _BITS_SIGTHREAD_H: u32 = 1;
pub const _SEMAPHORE_H: u32 = 1;
pub const __SIZEOF_SEM_T: u32 = 32;
pub const FID_F: &'static [u8; 10usize] = b"<%lx:%lx>\0";
pub const FID_SF: &'static [u8; 16usize] = b" < %lx : %lx > \0";
pub const M0_COMPOSITE_EXTENT_INF: i32 = -1;
pub const M0_DEBUG_BE_CREDITS: u32 = 1;
pub const BETXCR_F: &'static [u8; 10usize] = b"(%lu,%lu)\0";
pub const M0_BE_SEG_PG_PRESENT: i64 = -9223372036854775808;
pub const M0_BE_SEG_PG_PIN_CNT_MASK: u64 = 9223372036854775807;
pub const M0_BE_MUTEX_PAD: u32 = 168;
pub const M0_BE_RWLOCK_PAD: u32 = 144;
pub const EXT_F: &'static [u8; 11usize] = b"[%lx, %lx)\0";
pub const MAXPATHLEN: u32 = 1024;
pub const STOB_ID_F: &'static [u8; 22usize] = b"{<%lx:%lx>,<%lx:%lx>}\0";
pub const FOM_PHASE_DEBUG: u32 = 1;
pub const _CTYPE_H: u32 = 1;
pub const DTS0_F: &'static [u8; 5usize] = b"@%lu\0";
pub const DTID0_F: &'static [u8; 17usize] = b"{@%lu,<%lx:%lx>}\0";
pub type size_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union wait {
    pub w_status: ::std::os::raw::c_int,
    pub __wait_terminated: wait__bindgen_ty_1,
    pub __wait_stopped: wait__bindgen_ty_2,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct wait__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_wait__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<wait__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(wait__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<wait__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(wait__bindgen_ty_1))
    );
}
impl wait__bindgen_ty_1 {
    #[inline]
    pub fn __w_termsig(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set___w_termsig(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn __w_coredump(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set___w_coredump(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn __w_retcode(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set___w_retcode(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        __w_termsig: ::std::os::raw::c_uint,
        __w_coredump: ::std::os::raw::c_uint,
        __w_retcode: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 7u8, {
            let __w_termsig: u32 = unsafe { ::std::mem::transmute(__w_termsig) };
            __w_termsig as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let __w_coredump: u32 = unsafe { ::std::mem::transmute(__w_coredump) };
            __w_coredump as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let __w_retcode: u32 = unsafe { ::std::mem::transmute(__w_retcode) };
            __w_retcode as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct wait__bindgen_ty_2 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_wait__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<wait__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(wait__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<wait__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(wait__bindgen_ty_2))
    );
}
impl wait__bindgen_ty_2 {
    #[inline]
    pub fn __w_stopval(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set___w_stopval(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn __w_stopsig(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set___w_stopsig(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        __w_stopval: ::std::os::raw::c_uint,
        __w_stopsig: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let __w_stopval: u32 = unsafe { ::std::mem::transmute(__w_stopval) };
            __w_stopval as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let __w_stopsig: u32 = unsafe { ::std::mem::transmute(__w_stopsig) };
            __w_stopsig as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_wait() {
    assert_eq!(
        ::std::mem::size_of::<wait>(),
        4usize,
        concat!("Size of: ", stringify!(wait))
    );
    assert_eq!(
        ::std::mem::align_of::<wait>(),
        4usize,
        concat!("Alignment of ", stringify!(wait))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wait>())).w_status as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wait),
            "::",
            stringify!(w_status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wait>())).__wait_terminated as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wait),
            "::",
            stringify!(__wait_terminated)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wait>())).__wait_stopped as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wait),
            "::",
            stringify!(__wait_stopped)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __WAIT_STATUS {
    pub __uptr: *mut wait,
    pub __iptr: *mut ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___WAIT_STATUS() {
    assert_eq!(
        ::std::mem::size_of::<__WAIT_STATUS>(),
        8usize,
        concat!("Size of: ", stringify!(__WAIT_STATUS))
    );
    assert_eq!(
        ::std::mem::align_of::<__WAIT_STATUS>(),
        8usize,
        concat!("Alignment of ", stringify!(__WAIT_STATUS))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__WAIT_STATUS>())).__uptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__WAIT_STATUS),
            "::",
            stringify!(__uptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__WAIT_STATUS>())).__iptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__WAIT_STATUS),
            "::",
            stringify!(__iptr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> size_t;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type ssize_t = __ssize_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type time_t = __time_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulong;
pub type register_t = ::std::os::raw::c_long;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gnu_dev_major(__dev: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_minor(__dev: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_makedev(
        __major: ::std::os::raw::c_uint,
        __minor: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_ulonglong;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: pthread_mutex_t___pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutex_t___pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t___pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t___pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t___pthread_mutex_s>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(pthread_mutex_t___pthread_mutex_s)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__lock as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__count as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__owner as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__nusers as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__kind as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__spins as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__elision as *const _
                as usize
        },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_mutex_t___pthread_mutex_s>())).__list as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: pthread_cond_t__bindgen_ty_1,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_cond_t__bindgen_ty_1 {
    pub __lock: ::std::os::raw::c_int,
    pub __futex: ::std::os::raw::c_uint,
    pub __total_seq: ::std::os::raw::c_ulonglong,
    pub __wakeup_seq: ::std::os::raw::c_ulonglong,
    pub __woken_seq: ::std::os::raw::c_ulonglong,
    pub __mutex: *mut ::std::os::raw::c_void,
    pub __nwaiters: ::std::os::raw::c_uint,
    pub __broadcast_seq: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t__bindgen_ty_1>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__lock as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__futex as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__total_seq as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__total_seq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__wakeup_seq as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__wakeup_seq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__woken_seq as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__woken_seq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__mutex as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__mutex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__nwaiters as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__nwaiters)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_cond_t__bindgen_ty_1>())).__broadcast_seq as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__broadcast_seq)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: pthread_rwlock_t__bindgen_ty_1,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_rwlock_t__bindgen_ty_1 {
    pub __lock: ::std::os::raw::c_int,
    pub __nr_readers: ::std::os::raw::c_uint,
    pub __readers_wakeup: ::std::os::raw::c_uint,
    pub __writer_wakeup: ::std::os::raw::c_uint,
    pub __nr_readers_queued: ::std::os::raw::c_uint,
    pub __nr_writers_queued: ::std::os::raw::c_uint,
    pub __writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __pad1: ::std::os::raw::c_ulong,
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t__bindgen_ty_1>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__lock as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__nr_readers as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__nr_readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__readers_wakeup as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__readers_wakeup)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__writer_wakeup as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__writer_wakeup)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__nr_readers_queued
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__nr_readers_queued)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__nr_writers_queued
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__nr_writers_queued)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__pad1 as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__pad2 as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pthread_rwlock_t__bindgen_ty_1>())).__flags as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__flags)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).fptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).state as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_type as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_deg as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_sep as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).end_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: size_t,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__old_x as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__c as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__init as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__a as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn cfree(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: size_t,
        __size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: size_t, __size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(
        __pwcs: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn wcstombs(
        __s: *mut ::std::os::raw::c_char,
        __pwcs: *const wchar_t,
        __n: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
pub type FILE = _IO_FILE;
pub type __FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_jump_t {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(
        ::std::mem::size_of::<_IO_marker>(),
        24usize,
        concat!("Size of: ", stringify!(_IO_marker))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_marker>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_marker))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_marker>()))._next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_marker>()))._sbuf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_sbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_marker>()))._pos as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_pos)
        )
    );
}
pub const __codecvt_result___codecvt_ok: __codecvt_result = 0;
pub const __codecvt_result___codecvt_partial: __codecvt_result = 1;
pub const __codecvt_result___codecvt_error: __codecvt_result = 2;
pub const __codecvt_result___codecvt_noconv: __codecvt_result = 3;
pub type __codecvt_result = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::std::os::raw::c_void,
    pub __pad2: *mut ::std::os::raw::c_void,
    pub __pad3: *mut ::std::os::raw::c_void,
    pub __pad4: *mut ::std::os::raw::c_void,
    pub __pad5: size_t,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad1 as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad2 as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad3 as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad4 as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE_plus {
    _unused: [u8; 0],
}
extern "C" {
    pub static mut _IO_2_1_stdin_: _IO_FILE_plus;
}
extern "C" {
    pub static mut _IO_2_1_stdout_: _IO_FILE_plus;
}
extern "C" {
    pub static mut _IO_2_1_stderr_: _IO_FILE_plus;
}
pub type __io_read_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: size_t,
    ) -> __ssize_t,
>;
pub type __io_write_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> __ssize_t,
>;
pub type __io_seek_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type __io_close_fn = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn __underflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __uflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_getc(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_putc(__c: ::std::os::raw::c_int, __fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_feof(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_ferror(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_peekc_locked(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_flockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_funlockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_ftrylockfile(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfscanf(
        arg1: *mut _IO_FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
        arg4: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfprintf(
        arg1: *mut _IO_FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_padn(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int, arg3: __ssize_t)
        -> __ssize_t;
}
extern "C" {
    pub fn _IO_sgetn(
        arg1: *mut _IO_FILE,
        arg2: *mut ::std::os::raw::c_void,
        arg3: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn _IO_seekoff(
        arg1: *mut _IO_FILE,
        arg2: __off64_t,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> __off64_t;
}
extern "C" {
    pub fn _IO_seekpos(
        arg1: *mut _IO_FILE,
        arg2: __off64_t,
        arg3: ::std::os::raw::c_int,
    ) -> __off64_t;
}
extern "C" {
    pub fn _IO_free_backup_area(arg1: *mut _IO_FILE);
}
pub type fpos_t = _G_fpos_t;
extern "C" {
    pub static mut stdin: *mut _IO_FILE;
}
extern "C" {
    pub static mut stdout: *mut _IO_FILE;
}
extern "C" {
    pub static mut stderr: *mut _IO_FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: size_t,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut size_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: size_t);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __s: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_uint128 {
    pub u_hi: u64,
    pub u_lo: u64,
}
#[test]
fn bindgen_test_layout_m0_uint128() {
    assert_eq!(
        ::std::mem::size_of::<m0_uint128>(),
        16usize,
        concat!("Size of: ", stringify!(m0_uint128))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_uint128>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_uint128))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_uint128>())).u_hi as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_uint128),
            "::",
            stringify!(u_hi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_uint128>())).u_lo as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_uint128),
            "::",
            stringify!(u_lo)
        )
    );
}
extern "C" {
    pub fn m0_uint128_eq(u0: *const m0_uint128, u1: *const m0_uint128) -> bool;
}
extern "C" {
    pub fn m0_uint128_cmp(u0: *const m0_uint128, u1: *const m0_uint128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m0_uint128_init(u128_: *mut m0_uint128, magic: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " res = a + b;"]
    pub fn m0_uint128_add(res: *mut m0_uint128, a: *const m0_uint128, b: *const m0_uint128);
}
extern "C" {
    #[doc = " res = a * b;"]
    pub fn m0_uint128_mul64(res: *mut m0_uint128, a: u64, b: u64);
}
extern "C" {
    pub fn m0_uint128_sscanf(
        s: *const ::std::os::raw::c_char,
        u128_: *mut m0_uint128,
    ) -> ::std::os::raw::c_int;
}
#[doc = " count of bytes (in extent, IO operation, etc.)"]
pub type m0_bcount_t = u64;
#[doc = " an index (offset) in a linear name-space (e.g., in a file, storage object,"]
#[doc = "storage device, memory buffer) measured in bytes"]
pub type m0_bindex_t = u64;
pub const M0_BCOUNT_MAX: ::std::os::raw::c_ulong = 18446744073709551615;
pub const M0_BINDEX_MAX: ::std::os::raw::c_ulong = 18446744073709551614;
pub const M0_BSIGNED_MAX: ::std::os::raw::c_ulong = 9223372036854775807;
pub type _bindgen_ty_1 = ::std::os::raw::c_ulong;
#[doc = " Memory buffer."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_buf {
    pub b_nob: m0_bcount_t,
    pub b_addr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_m0_buf() {
    assert_eq!(
        ::std::mem::size_of::<m0_buf>(),
        16usize,
        concat!("Size of: ", stringify!(m0_buf))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_buf>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_buf))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_buf>())).b_nob as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_buf),
            "::",
            stringify!(b_nob)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_buf>())).b_addr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_buf),
            "::",
            stringify!(b_addr)
        )
    );
}
#[doc = " Sequence of memory buffers."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_bufs {
    pub ab_count: u32,
    pub ab_elems: *mut m0_buf,
}
#[test]
fn bindgen_test_layout_m0_bufs() {
    assert_eq!(
        ::std::mem::size_of::<m0_bufs>(),
        16usize,
        concat!("Size of: ", stringify!(m0_bufs))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_bufs>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_bufs))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_bufs>())).ab_count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_bufs),
            "::",
            stringify!(ab_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_bufs>())).ab_elems as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_bufs),
            "::",
            stringify!(ab_elems)
        )
    );
}
extern "C" {
    #[doc = " Initialises struct m0_buf."]
    pub fn m0_buf_init(buf: *mut m0_buf, data: *mut ::std::os::raw::c_void, nob: u32);
}
extern "C" {
    #[doc = " Allocates memory pointed to by @buf->b_addr of size @size."]
    pub fn m0_buf_alloc(buf: *mut m0_buf, size: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Frees memory pointed to by buf->b_addr and zeroes buffer's fields."]
    pub fn m0_buf_free(buf: *mut m0_buf);
}
extern "C" {
    #[doc = " Compares memory of two buffers."]
    #[doc = ""]
    #[doc = " Returns zero if buffers are equal (including their sizes). Otherwise, returns"]
    #[doc = " difference between the first pair of bytes that differ in `x' and `y'."]
    #[doc = " If buffers have different sizes and one is a prefix of the second,"]
    #[doc = " the sign of the expression (x->b_nob - y->b_nob) is returned."]
    #[doc = ""]
    #[doc = " Therefore, sign of the return value can be used to determine lexicographical"]
    #[doc = " order of the buffers."]
    #[doc = ""]
    #[doc = " m0_buf_cmp() can be treated as an analogue of strcmp(3) for m0_buf strings"]
    #[doc = " that may contain '\\0'."]
    pub fn m0_buf_cmp(x: *const m0_buf, y: *const m0_buf) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Returns true iff two buffers are equal."]
    pub fn m0_buf_eq(x: *const m0_buf, y: *const m0_buf) -> bool;
}
extern "C" {
    #[doc = " Copies a buffer without allocation."]
    #[doc = " Destination buffer must point to a valid memory location and it has to have"]
    #[doc = " the same size as the source buffer."]
    #[doc = ""]
    #[doc = " @pre dst->b_nob == src->b_nob"]
    pub fn m0_buf_memcpy(dst: *mut m0_buf, src: *const m0_buf);
}
extern "C" {
    #[doc = " Copies a buffer."]
    #[doc = ""]
    #[doc = " User is responsible for m0_buf_free()ing `dest'."]
    #[doc = ""]
    #[doc = " @pre   dest->b_nob == 0 && dest->b_addr == NULL"]
    #[doc = " @post  ergo(result == 0, m0_buf_eq(dest, src))"]
    pub fn m0_buf_copy(dest: *mut m0_buf, src: *const m0_buf) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Allocates 'buf' aligned on (2^shift)-byte boundary and copies 'data'"]
    #[doc = " into it."]
    pub fn m0_buf_new_aligned(
        buf: *mut m0_buf,
        data: *const ::std::os::raw::c_void,
        nob: u32,
        shift: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Allocates 'dst' buffer aligned on (2^shift)-byte boundary and copies 'src'"]
    #[doc = " into it."]
    #[doc = ""]
    #[doc = " @pre   dst->b_nob == 0 && dst->b_addr == NULL"]
    pub fn m0_buf_copy_aligned(
        dst: *mut m0_buf,
        src: *const m0_buf,
        shift: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Does the buffer point at anything?"]
    pub fn m0_buf_is_set(buf: *const m0_buf) -> bool;
}
extern "C" {
    #[doc = " Do `buf' and `str' contain equal sequences of non-'\\0' characters?"]
    #[doc = ""]
    #[doc = " @pre  str != NULL"]
    pub fn m0_buf_streq(buf: *const m0_buf, str_: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    #[doc = " Duplicates a string pointed to by buf->b_addr."]
    #[doc = ""]
    #[doc = " Maximum length of the resulting string, including null character,"]
    #[doc = " is buf->b_nob."]
    pub fn m0_buf_strdup(buf: *const m0_buf) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Constructs a sequence of memory buffers, copying data from"]
    #[doc = " NULL-terminated array of C strings."]
    #[doc = ""]
    #[doc = " User is responsible for m0_bufs_free()ing `dest'."]
    pub fn m0_bufs_from_strings(
        dest: *mut m0_bufs,
        src: *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Constructs a NULL-terminated array of C strings, copying data from a"]
    #[doc = " sequence of memory buffers."]
    #[doc = ""]
    #[doc = " The elements of `*dest' should be freed eventually."]
    #[doc = " @see  m0_strings_free()"]
    pub fn m0_bufs_to_strings(
        dest: *mut *mut *const ::std::os::raw::c_char,
        src: *const m0_bufs,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Checks equality of given sequences."]
    #[doc = ""]
    #[doc = " @see  m0_buf_streq()"]
    pub fn m0_bufs_streq(bufs: *const m0_bufs, strs: *mut *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    #[doc = " Frees memory buffers."]
    pub fn m0_bufs_free(bufs: *mut m0_bufs);
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
#[doc = " Panic context"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_panic_ctx {
    #[doc = " Panic message, usually it's a failed condition, which \"triggers\""]
    #[doc = " panic."]
    pub pc_expr: *const ::std::os::raw::c_char,
    #[doc = " Name of a function, which calls m0_panic(), i.e. __func__"]
    pub pc_func: *const ::std::os::raw::c_char,
    #[doc = " Name of a file, i.e. __FILE__"]
    pub pc_file: *const ::std::os::raw::c_char,
    #[doc = " Line number, i.e. __LINE__"]
    pub pc_lineno: ::std::os::raw::c_int,
    #[doc = " Additional informational message with printf(3) like formatting,"]
    #[doc = " which will be displayed after the failed condition and can be used as"]
    #[doc = " an explanation of why condition has failed"]
    pub pc_fmt: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_m0_panic_ctx() {
    assert_eq!(
        ::std::mem::size_of::<m0_panic_ctx>(),
        40usize,
        concat!("Size of: ", stringify!(m0_panic_ctx))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_panic_ctx>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_panic_ctx))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_panic_ctx>())).pc_expr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_panic_ctx),
            "::",
            stringify!(pc_expr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_panic_ctx>())).pc_func as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_panic_ctx),
            "::",
            stringify!(pc_func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_panic_ctx>())).pc_file as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_panic_ctx),
            "::",
            stringify!(pc_file)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_panic_ctx>())).pc_lineno as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_panic_ctx),
            "::",
            stringify!(pc_lineno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_panic_ctx>())).pc_fmt as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_panic_ctx),
            "::",
            stringify!(pc_fmt)
        )
    );
}
extern "C" {
    #[doc = " Display panic message and abort program execution."]
    #[doc = ""]
    #[doc = " @param ctx     panic context"]
    #[doc = " @param ...     arguments for printf format string m0_panic_ctx::pc_fmt"]
    pub fn m0_panic(ctx: *const m0_panic_ctx, ...);
}
extern "C" {
    #[doc = " Abort program execution."]
    #[doc = ""]
    #[doc = " This function is similar to m0_panic(), but doesn't call M0_LOG() nor"]
    #[doc = " checks for a double panic. Therefore, it can be called on early stages"]
    #[doc = " of initialisation."]
    pub fn m0_panic_only(ctx: *const m0_panic_ctx, ...);
}
extern "C" {
    pub fn m0_arch_panic(ctx: *const m0_panic_ctx, ap: *mut __va_list_tag);
}
extern "C" {
    pub fn m0_backtrace();
}
extern "C" {
    pub fn m0_arch_backtrace();
}
extern "C" {
    #[doc = "Location where _0C() macro stores the name of failed asserted expression."]
    pub static mut m0_failed_condition: *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Called by _0C() when invariant conjunct fails."]
    #[doc = ""]
    #[doc = "Useful thing to put a breakpoint at."]
    pub fn m0__assertion_hook();
}
extern "C" {
    #[doc = " Invokes a debugger, if possible."]
    #[doc = ""]
    #[doc = " This can be used for debugging purposes. Note that this function can return."]
    #[doc = ""]
    #[doc = " In user space, this function invokes the debugger specified in M0_DEBUGGER"]
    #[doc = " environment variable."]
    #[doc = ""]
    #[doc = " In Linux kernel this breaks in kgdb, if configured."]
    pub fn m0_debugger_invoke();
}
extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: __locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: size_t,
        __l: __locale_t,
    ) -> size_t;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: __locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __bzero(__s: *mut ::std::os::raw::c_void, __n: size_t);
}
extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: size_t,
    );
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Resolve hostname."]
    pub fn m0_host_resolve(
        name: *const ::std::os::raw::c_char,
        buf: *mut ::std::os::raw::c_char,
        bufsiz: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Print performance counters: getrusage(), /proc/self/io."]
    #[doc = ""]
    #[doc = " All errors (can't open file etc.) are silently ignored."]
    pub fn m0_performance_counters(buf: *mut ::std::os::raw::c_char, buf_len: size_t);
}
extern "C" {
    #[doc = " Returns rounded up value of @val in chunks of @size."]
    #[doc = " @pre m0_is_po2(size)"]
    pub fn m0_round_up(val: u64, size: u64) -> u64;
}
extern "C" {
    #[doc = " Returns rounded down value of @val in chunks of @size."]
    #[doc = " @pre m0_is_po2(size)"]
    pub fn m0_round_down(val: u64, size: u64) -> u64;
}
extern "C" {
    pub fn m0_bool_to_str(b: bool) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Extracts the file name, relative to a motr sources directory, from a"]
    #[doc = " full-path file name. A motr source directory is detected by a name"]
    #[doc = " \"motr/\"."]
    #[doc = ""]
    #[doc = " For example, given the following full-path file name:"]
    #[doc = ""]
    #[doc = "     /path/to/motr/lib/ut/finject.c"]
    #[doc = ""]
    #[doc = " A short file name, relative to the \"motr/\" directory, is:"]
    #[doc = ""]
    #[doc = "     lib/ut/finject.c"]
    #[doc = ""]
    #[doc = " @bug {"]
    #[doc = "     This function doesn't search for the rightmost occurrence of \"motr/\""]
    #[doc = "     in a file path, if \"motr/\" encounters several times in the path the first"]
    #[doc = "     one will be picked up:"]
    #[doc = ""]
    #[doc = "       /path/to/motr/fs/motr/lib/misc.h => fs/motr/lib/misc.h"]
    #[doc = " }"]
    #[doc = ""]
    #[doc = " @param   fname  full path"]
    #[doc = ""]
    #[doc = " @return  short file name - a pointer inside fname string to the remaining"]
    #[doc = "          file path, after motr source directory;"]
    #[doc = "          if short file name cannot be found, then full fname is returned."]
    pub fn m0_short_file_name(
        fname: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn m0_strtou64(
        str_: *const ::std::os::raw::c_char,
        endptr: *mut *mut ::std::os::raw::c_char,
        base: ::std::os::raw::c_int,
    ) -> u64;
}
extern "C" {
    pub fn m0_strtou32(
        str_: *const ::std::os::raw::c_char,
        endptr: *mut *mut ::std::os::raw::c_char,
        base: ::std::os::raw::c_int,
    ) -> u32;
}
extern "C" {
    pub fn __dummy_function();
}
extern "C" {
    pub fn m0_elems_are_unique(
        array: *const ::std::os::raw::c_void,
        nr_elems: ::std::os::raw::c_uint,
        elem_size: size_t,
    ) -> bool;
}
extern "C" {
    pub fn m0_no_of_bits_set(val: u64) -> u32;
}
extern "C" {
    pub fn m0_full_name_hash(
        name: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " Converts Motr function pointer in a form that can be stored somewhere (e.g.,"]
    #[doc = " in a trace log or addb2 record) and later decoded back into original pointer."]
    #[doc = ""]
    #[doc = " Such transformation is needed, because function pointers depend on the"]
    #[doc = " address at which Motr library is loaded."]
    #[doc = ""]
    #[doc = " @pre \"p\" must be a pointer to Motr executable code or NULL."]
    pub fn m0_ptr_wrap(p: *const ::std::os::raw::c_void) -> u64;
}
extern "C" {
    pub fn m0_ptr_unwrap(val: u64) -> *const ::std::os::raw::c_void;
}
pub const UINT32_STR_LEN: ::std::os::raw::c_uint = 64;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
#[doc = " An object representing a key value pair."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_key_val {
    pub kv_key: m0_buf,
    pub kv_val: m0_buf,
}
#[test]
fn bindgen_test_layout_m0_key_val() {
    assert_eq!(
        ::std::mem::size_of::<m0_key_val>(),
        32usize,
        concat!("Size of: ", stringify!(m0_key_val))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_key_val>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_key_val))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_key_val>())).kv_key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_key_val),
            "::",
            stringify!(kv_key)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_key_val>())).kv_val as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_key_val),
            "::",
            stringify!(kv_val)
        )
    );
}
extern "C" {
    #[doc = " Apply a permutation given by its Lehmer code in k[] to a set s[] of n"]
    #[doc = " elements and build inverse permutation in r[]."]
    #[doc = ""]
    #[doc = " @param n - number of elements in k[], s[] and r[]"]
    #[doc = " @param k - Lehmer code of the permutation"]
    #[doc = " @param s - an array to permute"]
    #[doc = " @param r - an array to build inverse permutation in"]
    #[doc = ""]
    #[doc = " @pre  m0_forall(i, n, k[i] + i < n)"]
    #[doc = " @pre  m0_forall(i, n, s[i] < n && ergo(s[i] == s[j], i == j))"]
    #[doc = " @post m0_forall(i, n, s[i] < n && ergo(s[i] == s[j], i == j))"]
    #[doc = " @post m0_forall(i, n, s[r[i]] == i && r[s[i]] == i)"]
    pub fn m0_permute(n: u64, k: *mut u64, s: *mut u64, r: *mut u64);
}
extern "C" {
    #[doc = " Sorts an array of integers in ascending order."]
    pub fn m0_array_sort(arr: *mut u64, arr_len: u64);
}
extern "C" {
    #[doc = " Get i-th bit value from the buffer."]
    pub fn m0_bit_get(buffer: *mut ::std::os::raw::c_void, i: m0_bcount_t) -> bool;
}
extern "C" {
    #[doc = "Set i-th bit value in the buffer."]
    pub fn m0_bit_set(buffer: *mut ::std::os::raw::c_void, i: m0_bcount_t, val: bool);
}
extern "C" {
    #[doc = " Initialises a key value pair."]
    pub fn m0_key_val_init(kv: *mut m0_key_val, key: *const m0_buf, val: *const m0_buf);
}
extern "C" {
    #[doc = " This API implements Boyer-Moore Voting Algorithm."]
    #[doc = " Returns the majority element present in an input array. The majority element"]
    #[doc = " of an array, if present, is the element that occurs more than n/2 times in"]
    #[doc = " the array of length n. It has been assumed that members of the array can be"]
    #[doc = " compared for equality and method for the same needs to be provided by the"]
    #[doc = " user of the API."]
    #[doc = " Returns null if there is no majority element."]
    pub fn m0_vote_majority_get(
        arr: *mut m0_key_val,
        len: u32,
        cmp: ::std::option::Option<
            unsafe extern "C" fn(arg1: *const m0_buf, arg2: *const m0_buf) -> bool,
        >,
        vote_nr: *mut u32,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Returns true iff it's M0_KEY_VAL_NULL."]
    pub fn m0_key_val_is_null(kv: *mut m0_key_val) -> bool;
}
extern "C" {
    #[doc = " Initialises a key to M0_KEY_VAL_NULL."]
    pub fn m0_key_val_null_set(kv: *mut m0_key_val);
}
extern "C" {
    pub static M0_KEY_VAL_NULL: m0_key_val;
}
extern "C" {
    #[doc = " Generates process-uinque identifier. WARN: Atomic based."]
    pub fn m0_dummy_id_generate() -> u64;
}
#[doc = " Number of nodes which originate from root of radix tree."]
pub const m0_varr_tree_char_M0_VA_TNODE_NR: m0_varr_tree_char = 64;
#[doc = " Size of pointer to a tree node."]
pub const m0_varr_tree_char_M0_VA_TNODEPTR_SIZE: m0_varr_tree_char = 8;
#[doc = " Log (M0_VA_TNODE_NR) to base 2."]
pub const m0_varr_tree_char_M0_VA_TNODE_NR_SHIFT: m0_varr_tree_char = 6;
#[doc = " Maximum allowable depth of a tree."]
pub const m0_varr_tree_char_M0_VA_DEPTH_MAX: m0_varr_tree_char = 16;
#[doc = " @defgroup varr Virtual array"]
#[doc = " A virtual array represents a data structure which can be used at places"]
#[doc = " where big contiguous memory allocations are not possible."]
#[doc = ""]
#[doc = " Virtual array can be used for big arrays or pointers which would potentially"]
#[doc = " hold large memory areas. Virtual array library provides interface for"]
#[doc = " read, write, and iterate over an array."]
#[doc = ""]
#[doc = " Using such structures can be especially helpful in kernel where contiguity"]
#[doc = " of pages is not guaranteed, and any memory allocation growing beyond page"]
#[doc = " size can essentially fail. Current implementation supports both user-space"]
#[doc = " as well as kernel versions."]
#[doc = ""]
#[doc = " The structure of virtual array is kept something similar to a block map"]
#[doc = " from an on-disk inode with multiple indirections."]
#[doc = ""]
#[doc = " Using pointer arithmetic on virtual array is strongly discouraged since"]
#[doc = " it does not guarantee contiguity of buffers."]
#[doc = ""]
#[doc = " A virtual array uses a radix-tree like structure whose height is"]
#[doc = " dependent on number of objects to be accommodated in the array."]
#[doc = ""]
#[doc = " Following example illustrates the usage of various interfaces"]
#[doc = " that are provided by virtual array library."]
#[doc = ""]
#[doc = " Consider an array consisting of OBJ_NR number of objects, of the type"]
#[doc = " unsigned long. Library leaves it to its user what shall be the size of a"]
#[doc = " buffer holding objects. Following example uses M0_0VEC_ALIGN as buffer size."]
#[doc = ""]
#[doc = " @code"]
#[doc = ""]
#[doc = " struct m0_varr varr;"]
#[doc = ""]
#[doc = " enum {"]
#[doc = "         OBJ_NR = 10203040,"]
#[doc = " };"]
#[doc = ""]
#[doc = " rc = m0_varr_init(&varr, OBJ_NR, sizeof(unsigned long), M0_0VEC_ALIGN);"]
#[doc = ""]
#[doc = " m0_varr_iter(&varr, unsigned long, id, obj, 0, m0_varr_size(&varr), 1) {"]
#[doc = "\t*obj = id;"]
#[doc = " } m0_varr_enditer;"]
#[doc = ""]
#[doc = " m0_varr_iter(&varr, unsigned long, id, obj, 0, m0_varr_size(&varr), 1) {"]
#[doc = "         ptr = m0_varr_ele_get(&varr, id);"]
#[doc = "         M0_ASSERT(*ptr == *obj);"]
#[doc = " } m0_varr_enditer;"]
#[doc = ""]
#[doc = " m0_varr_fini(&varr);"]
#[doc = ""]
#[doc = " @endcode"]
#[doc = " @{"]
pub type m0_varr_tree_char = ::std::os::raw::c_uint;
extern "C" {
    pub static mut __static_assertion: [::std::os::raw::c_char; 1usize];
}
#[doc = " An object that holds address of a node, and its index within a buffer of"]
#[doc = " width vp_width."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_varr_path_element {
    pub vp_idx: u32,
    pub vp_width: u32,
    pub vp_buf: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_m0_varr_path_element() {
    assert_eq!(
        ::std::mem::size_of::<m0_varr_path_element>(),
        16usize,
        concat!("Size of: ", stringify!(m0_varr_path_element))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_varr_path_element>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_varr_path_element))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr_path_element>())).vp_idx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr_path_element),
            "::",
            stringify!(vp_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr_path_element>())).vp_width as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr_path_element),
            "::",
            stringify!(vp_width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr_path_element>())).vp_buf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr_path_element),
            "::",
            stringify!(vp_buf)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_varr_cursor {
    pub vc_arr: *mut m0_varr,
    pub vc_depth: u32,
    #[doc = " Number of leaf level nodes behind cursor's current position."]
    pub vc_done: u64,
    #[doc = " Holds addresses of those nodes which form a path between the root"]
    #[doc = " node and current cursor position. Address of a node at level 'i'"]
    #[doc = " on a path is stored in vc_path[i]."]
    pub vc_path: [m0_varr_path_element; 16usize],
}
#[test]
fn bindgen_test_layout_m0_varr_cursor() {
    assert_eq!(
        ::std::mem::size_of::<m0_varr_cursor>(),
        280usize,
        concat!("Size of: ", stringify!(m0_varr_cursor))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_varr_cursor>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_varr_cursor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr_cursor>())).vc_arr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr_cursor),
            "::",
            stringify!(vc_arr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr_cursor>())).vc_depth as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr_cursor),
            "::",
            stringify!(vc_depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr_cursor>())).vc_done as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr_cursor),
            "::",
            stringify!(vc_done)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr_cursor>())).vc_path as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr_cursor),
            "::",
            stringify!(vc_path)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_varr {
    #[doc = " Number of elements in array."]
    pub va_nr: u64,
    #[doc = " Number of leaf buffers."]
    pub va_buff_nr: u64,
    pub va_obj_size: size_t,
    #[doc = " Log of object-size to the base two."]
    pub va_obj_shift: u8,
    #[doc = " Size of buffer which is used to store objects and buffer-pointers"]
    #[doc = " from a tree."]
    pub va_bufsize: size_t,
    #[doc = " Log of va_bufsize to the base two."]
    pub va_buf_shift: u8,
    #[doc = " Depth of tree proportional to number of objects stored."]
    pub va_depth: u32,
    #[doc = " Number of pointers that can be accommodated in one"]
    #[doc = " meta buffer. This number is easy to calculate and need not be stored"]
    #[doc = " as a member of structure. However, during tree traversal, this"]
    #[doc = " number is calculated multiple times in each trail, owing to"]
    #[doc = " significant and _exactly same_ compute operations which can be"]
    #[doc = " easily avoided by maintaining it as a member."]
    pub va_bufptr_nr: u64,
    pub va_bufptr_nr_shift: u8,
    #[doc = " Array of radix tree nodes, each of which represents an abstraction"]
    #[doc = " of buffer containing multitude of objects."]
    #[doc = " The arrangement is such that there could be n levels within any"]
    #[doc = " tree node before a leaf node is reached."]
    pub va_tree: [*mut ::std::os::raw::c_void; 64usize],
    #[doc = " Holds address of a buffer holding recently accessed object."]
    pub va_cache: *mut varr_cache,
    #[doc = " Holds the cursor depth in case of a failure."]
    pub va_failure_depth: u32,
    #[doc = " Magic field to cross check sanity of structure."]
    pub va_magic: u64,
}
#[test]
fn bindgen_test_layout_m0_varr() {
    assert_eq!(
        ::std::mem::size_of::<m0_varr>(),
        600usize,
        concat!("Size of: ", stringify!(m0_varr))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_varr>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_varr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr>())).va_nr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr),
            "::",
            stringify!(va_nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr>())).va_buff_nr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr),
            "::",
            stringify!(va_buff_nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr>())).va_obj_size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr),
            "::",
            stringify!(va_obj_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr>())).va_obj_shift as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr),
            "::",
            stringify!(va_obj_shift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr>())).va_bufsize as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr),
            "::",
            stringify!(va_bufsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr>())).va_buf_shift as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr),
            "::",
            stringify!(va_buf_shift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr>())).va_depth as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr),
            "::",
            stringify!(va_depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr>())).va_bufptr_nr as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr),
            "::",
            stringify!(va_bufptr_nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr>())).va_bufptr_nr_shift as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr),
            "::",
            stringify!(va_bufptr_nr_shift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr>())).va_tree as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr),
            "::",
            stringify!(va_tree)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr>())).va_cache as *const _ as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr),
            "::",
            stringify!(va_cache)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr>())).va_failure_depth as *const _ as usize },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr),
            "::",
            stringify!(va_failure_depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_varr>())).va_magic as *const _ as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_varr),
            "::",
            stringify!(va_magic)
        )
    );
}
extern "C" {
    #[doc = " Initialises a virtual array."]
    #[doc = " @param  nr[in]      Length of array."]
    #[doc = " @param  size[in]    Size of object to be stored in array."]
    #[doc = " @param  bufsize[in] Size of each buffer which stores the objects."]
    #[doc = " @retval 0\t       On success."]
    #[doc = " @retval -ENOMEM     On failure."]
    #[doc = " @pre   arr != NULL && nr > 0."]
    #[doc = " @post  varr_invariant(arr)."]
    pub fn m0_varr_init(
        arr: *mut m0_varr,
        nr: u64,
        size: size_t,
        bufsize: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Finalises a virtual array."]
    #[doc = " @pre varr_invariant(arr)"]
    pub fn m0_varr_fini(arr: *mut m0_varr);
}
extern "C" {
    #[doc = " Returns address of an object having index as 'index'. Updates an internal"]
    #[doc = " cache if required. Since concurrent access to the cache may result in"]
    #[doc = " spurious outcome, calls to m0_varr_ele_get() should be protected under a"]
    #[doc = " lock."]
    #[doc = " @pre  arr != NULL && index < arr->va_nr."]
    #[doc = " @post varr_invariant(arr)."]
    pub fn m0_varr_ele_get(arr: *mut m0_varr, index: u64) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Returns the number of elements stored in an array."]
    pub fn m0_varr_size(arr: *const m0_varr) -> u64;
}
extern "C" {
    #[doc = " Initializes a cursor to the address of the first node at given depth."]
    #[doc = " @param arr    [in]    An array to which a cursor gets associated."]
    #[doc = " @param depth  [in]    Depth to which cursor is initialized."]
    #[doc = " @param cursor [out]"]
    #[doc = " @retval\t  0      On success."]
    #[doc = " @retval\t -EINVAL On failure."]
    #[doc = " @pre\tarr != NULL"]
    #[doc = " @pre depth <= arr->va_depth"]
    pub fn m0_varr_cursor_init(
        cursor: *mut m0_varr_cursor,
        arr: *const m0_varr,
        depth: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Returns a pointer corresponding to the current location of a cursor."]
    #[doc = " @pre\tm0_varr_cursor_init()"]
    pub fn m0_varr_cursor_get(cursor: *mut m0_varr_cursor) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Moves cursor to the next node at the same level as m0_varr_cursor::vc_depth."]
    #[doc = " @retval 1 On success."]
    #[doc = " @retval 0 On completion of all nodes at level m0_varr_cursor::vc_depth."]
    pub fn m0_varr_cursor_next(cursor: *mut m0_varr_cursor) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Moves the cursor location by 'inc', along the same level as"]
    #[doc = " m0_varr_cursor::vc_depth."]
    #[doc = " @retval 1 On success."]
    #[doc = " @retval 0 On completion of all nodes at level m0_varr_cursor::vc_depth."]
    #[doc = " @pre\tm0_varr_cursor_init()"]
    pub fn m0_varr_cursor_move(cursor: *mut m0_varr_cursor, inc: u64) -> ::std::os::raw::c_int;
}
#[doc = "A vector of \"segments\" where each segment is something having a \"count\"."]
#[doc = ""]
#[doc = "m0_vec is used to implement functionality common to various \"scatter-gather\""]
#[doc = "data-structures, like m0_indexvec, m0_bufvec."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_vec {
    #[doc = " number of segments in the vector"]
    pub v_nr: u32,
    #[doc = " array of segment counts"]
    pub v_count: *mut m0_bcount_t,
}
#[test]
fn bindgen_test_layout_m0_vec() {
    assert_eq!(
        ::std::mem::size_of::<m0_vec>(),
        16usize,
        concat!("Size of: ", stringify!(m0_vec))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_vec>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_vec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_vec>())).v_nr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_vec),
            "::",
            stringify!(v_nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_vec>())).v_count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_vec),
            "::",
            stringify!(v_count)
        )
    );
}
extern "C" {
    #[doc = " Returns total count of vector"]
    pub fn m0_vec_count(vec: *const m0_vec) -> m0_bcount_t;
}
extern "C" {
    pub fn m0_vec_is_empty(vec: *const m0_vec) -> bool;
}
#[doc = "Position within a vector."]
#[doc = ""]
#[doc = "m0_vec_cursor is a cursor associated with a m0_vec instance. A cursor can be"]
#[doc = "moved in the forward direction."]
#[doc = ""]
#[doc = "A cursor can be in one of the two exclusive states:"]
#[doc = ""]
#[doc = "@li it is positioned within one of the vector segments. In this state"]
#[doc = ""]
#[doc = "@code"]
#[doc = "cur->vc_seg < cur->vc_vec->v_nr &&"]
#[doc = "cur->vc_offset < cur->vc_vec->v_count[cur->vc_seg]"]
#[doc = "@endcode"]
#[doc = ""]
#[doc = "invariant is maintained. This is called a \"normal\" state."]
#[doc = ""]
#[doc = "@li or a cursor is in an \"end of the vector\" state. In this state"]
#[doc = ""]
#[doc = "@code"]
#[doc = "cur->vc_seg == cur->vc_vec->v_nr && cur->vc_offset == 0"]
#[doc = "@endcode"]
#[doc = ""]
#[doc = "Note that a cursor over an empty vector (one with vec::v_nr == 0) is always"]
#[doc = "in the end of the vector state."]
#[doc = ""]
#[doc = "Also note, that according to the normal state invariant, a cursor cannot be"]
#[doc = "positioned in an empty segment (one with zero count). Empty segments are"]
#[doc = "skipped over by all cursor manipulating functions, including constructor."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_vec_cursor {
    pub vc_vec: *const m0_vec,
    #[doc = " Segment that the cursor is currently in."]
    pub vc_seg: u32,
    #[doc = " Offset within the segment that the cursor is positioned at."]
    pub vc_offset: m0_bcount_t,
}
#[test]
fn bindgen_test_layout_m0_vec_cursor() {
    assert_eq!(
        ::std::mem::size_of::<m0_vec_cursor>(),
        24usize,
        concat!("Size of: ", stringify!(m0_vec_cursor))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_vec_cursor>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_vec_cursor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_vec_cursor>())).vc_vec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_vec_cursor),
            "::",
            stringify!(vc_vec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_vec_cursor>())).vc_seg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_vec_cursor),
            "::",
            stringify!(vc_seg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_vec_cursor>())).vc_offset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_vec_cursor),
            "::",
            stringify!(vc_offset)
        )
    );
}
extern "C" {
    #[doc = "Initialise a cursor."]
    #[doc = ""]
    #[doc = "Cursor requires no special finalisation."]
    pub fn m0_vec_cursor_init(cur: *mut m0_vec_cursor, vec: *const m0_vec);
}
extern "C" {
    #[doc = "Move cursor count bytes further through the vector."]
    #[doc = ""]
    #[doc = "m0_vec_cursor_move(cur, 0) is guaranteed to return true iff cursor is in end"]
    #[doc = "of the vector position without modifying cursor in any way."]
    #[doc = ""]
    #[doc = "@return true, iff the end of the vector has been reached while moving. The"]
    #[doc = "cursor is in end of the vector position in this case."]
    pub fn m0_vec_cursor_move(cur: *mut m0_vec_cursor, count: m0_bcount_t) -> bool;
}
extern "C" {
    #[doc = "Return number of bytes that the cursor have to be moved to reach the next"]
    #[doc = "segment in its vector (or to move into end of the vector position, when the"]
    #[doc = "cursor is already at the last segment)."]
    #[doc = ""]
    #[doc = "@pre cur->vc_seg < cur->vc_vec->v_nr"]
    pub fn m0_vec_cursor_step(cur: *const m0_vec_cursor) -> m0_bcount_t;
}
extern "C" {
    #[doc = "Return number of bytes that the cursor have to be moved to reach the"]
    #[doc = "end of the vector position."]
    #[doc = ""]
    #[doc = "@pre cur->vc_seg < cur->vc_vec->v_nr"]
    pub fn m0_vec_cursor_end(cur: *const m0_vec_cursor) -> m0_bcount_t;
}
#[doc = " Vector of extents in a linear name-space"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_indexvec {
    #[doc = " Number of extents and their sizes."]
    pub iv_vec: m0_vec,
    #[doc = " Array of starting extent indices."]
    pub iv_index: *mut m0_bindex_t,
}
#[test]
fn bindgen_test_layout_m0_indexvec() {
    assert_eq!(
        ::std::mem::size_of::<m0_indexvec>(),
        24usize,
        concat!("Size of: ", stringify!(m0_indexvec))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_indexvec>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_indexvec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_indexvec>())).iv_vec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_indexvec),
            "::",
            stringify!(iv_vec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_indexvec>())).iv_index as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_indexvec),
            "::",
            stringify!(iv_index)
        )
    );
}
#[doc = " Vector of memory buffers"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_bufvec {
    #[doc = " Number of buffers and their sizes."]
    pub ov_vec: m0_vec,
    #[doc = " Array of buffer addresses."]
    pub ov_buf: *mut *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_m0_bufvec() {
    assert_eq!(
        ::std::mem::size_of::<m0_bufvec>(),
        24usize,
        concat!("Size of: ", stringify!(m0_bufvec))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_bufvec>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_bufvec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_bufvec>())).ov_vec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_bufvec),
            "::",
            stringify!(ov_vec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_bufvec>())).ov_buf as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_bufvec),
            "::",
            stringify!(ov_buf)
        )
    );
}
extern "C" {
    #[doc = "Allocates memory for a struct m0_bufvec.  All segments are of equal"]
    #[doc = "size."]
    #[doc = "The internal struct m0_vec is also allocated by this routine."]
    #[doc = "@pre num_segs > 0 && seg_size > 0"]
    #[doc = ""]
    #[doc = "@param bufvec Pointer to buffer vector to be initialized."]
    #[doc = "@param num_segs Number of memory segments."]
    #[doc = "@param seg_size Size of each segment."]
    #[doc = "@retval 0 On success."]
    #[doc = "@retval -errno On failure."]
    #[doc = "@see m0_bufvec_free()"]
    pub fn m0_bufvec_alloc(
        bufvec: *mut m0_bufvec,
        num_segs: u32,
        seg_size: m0_bcount_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " The same as m0_bufvec_alloc(), but doesn't allocate memory for segments."]
    pub fn m0_bufvec_empty_alloc(bufvec: *mut m0_bufvec, num_segs: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Assumes that all segments are of equal size. All additional"]
    #[doc = "segments are of the size of the initial segment in bufvec."]
    #[doc = "The internal struct m0_vec is also allocated by this routine."]
    #[doc = "@pre num_segs > 0"]
    #[doc = "@pre bufvec != NULL"]
    #[doc = "@pre bufvec->ov_buf != NULL"]
    #[doc = "@pre bufvec->ov_vec.v_nr > 0"]
    #[doc = ""]
    #[doc = "@param bufvec Pointer to buffer vector to be extended."]
    #[doc = "@param num_segs Number of memory segments by which bufvec is to"]
    #[doc = "be extended."]
    pub fn m0_bufvec_extend(bufvec: *mut m0_bufvec, num_segs: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Merges the source bufvec to the destination bufvec."]
    #[doc = " Assumes that all segments are of equal size."]
    #[doc = " Does not allocate bufvec->ov_buf, but does pointer manipulation"]
    #[doc = " such that src_bufvec's ov_bufs are appended to dst_bufvec's ov_bufs."]
    #[doc = " @pre num_segs > 0 for both source and destination bufvecs"]
    #[doc = " @pre seg_size > 0 for both source and destination bufvecs"]
    #[doc = " @pre ov_buf != NULL for both source and destination bufvecs"]
    #[doc = " @pre src_bufvec != NULL, dst_bufvec != NULL"]
    #[doc = ""]
    #[doc = " @param dst_bufvec Pointer to the destination buffer in which the new bufvec"]
    #[doc = "                   is to be merged."]
    #[doc = " @param src_bufvec Pointer to the source buffer which is to be merged."]
    pub fn m0_bufvec_merge(
        dst_bufvec: *mut m0_bufvec,
        src_bufvec: *mut m0_bufvec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Allocates aligned memory as specified by shift value for a struct m0_bufvec."]
    #[doc = "Currently in kernel mode it supports PAGE_SIZE alignment only."]
    pub fn m0_bufvec_alloc_aligned(
        bufvec: *mut m0_bufvec,
        num_segs: u32,
        seg_size: m0_bcount_t,
        shift: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Allocates aligned memory as specified by shift value for a struct m0_bufvec."]
    #[doc = "In userspace mode used for allocation of large buffers contigously."]
    pub fn m0_bufvec_alloc_aligned_packed(
        bufvec: *mut m0_bufvec,
        num_segs: u32,
        seg_size: m0_bcount_t,
        shift: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Make all its memory excluded from core dump."]
    pub fn m0__bufvec_dont_dump(bufvec: *mut m0_bufvec) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Frees the buffers pointed to by m0_bufvec.ov_buf and"]
    #[doc = "the m0_bufvec.ov_vec vector, using m0_free()."]
    #[doc = "@param bufvec Pointer to the m0_bufvec."]
    #[doc = "@see m0_bufvec_alloc()"]
    pub fn m0_bufvec_free(bufvec: *mut m0_bufvec);
}
extern "C" {
    #[doc = " The same as m0_bufvec_free(), but doesn't free the buffers pointed by"]
    #[doc = " m0_bufvec->ov_buf[]. Only m0_bufvec structure is freed."]
    pub fn m0_bufvec_free2(bufvec: *mut m0_bufvec);
}
extern "C" {
    #[doc = "Frees the buffers pointed to by m0_bufvec.ov_buf and"]
    #[doc = "the m0_bufvec.ov_vec vector, using m0_free_aligned()."]
    #[doc = "@param bufvec Pointer to the m0_bufvec."]
    #[doc = "@see m0_bufvec_alloc_aligned()"]
    pub fn m0_bufvec_free_aligned(bufvec: *mut m0_bufvec, shift: ::std::os::raw::c_uint);
}
extern "C" {
    #[doc = "@see m0_bufvec_free_aligned()."]
    #[doc = "in userspace mode used for allocation of large buffers contigously."]
    pub fn m0_bufvec_free_aligned_packed(bufvec: *mut m0_bufvec, shift: ::std::os::raw::c_uint);
}
extern "C" {
    #[doc = " Packs buffers vector by squashing its contiguous or overlapping chunks."]
    #[doc = " @pre bufvec->ov_vec.v_nr > 0."]
    #[doc = " @return the number of squashed chunks."]
    pub fn m0_bufvec_pack(bufvec: *mut m0_bufvec) -> u32;
}
extern "C" {
    #[doc = " Flattens first nr bytes of a buffer vector into one buffer."]
    pub fn m0_bufvec_splice(
        bvec: *const m0_bufvec,
        nr: m0_bcount_t,
        buf: *mut m0_buf,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Allocate memory for index array and counts array in index vector."]
    #[doc = " @param len Number of elements to allocate memory for."]
    #[doc = " @pre   ivec != NULL && len > 0."]
    #[doc = " @post  ivec->iv_index != NULL && ivec->iv_vec.v_count != NULL &&"]
    #[doc = "        ivec->iv_vec.v_nr == len."]
    #[doc = " @post  ergo(retval == -ENOMEM, ivec->iv_index == NULL)"]
    pub fn m0_indexvec_alloc(ivec: *mut m0_indexvec, len: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Deallocates the memory buffers pointed to by index array and counts array."]
    #[doc = " Also sets the array count to zero."]
    #[doc = " If ivec->iv_index == NULL - does nothing."]
    #[doc = " @pre  ivec != NULL."]
    #[doc = " @post ivec->iv_index == NULL && ivec->iv_vec.v_count == NULL &&"]
    #[doc = "       ivec->iv_vec.v_nr == 0."]
    pub fn m0_indexvec_free(ivec: *mut m0_indexvec);
}
extern "C" {
    #[doc = " Packs index vector by squashing its contiguous or overlapping chunks."]
    #[doc = " @pre ivec->iv_vec.v_nr > 0."]
    #[doc = " @return the number of squashed chunks."]
    pub fn m0_indexvec_pack(ivec: *mut m0_indexvec) -> u32;
}
#[doc = " Cursor to traverse a bufvec"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_bufvec_cursor {
    #[doc = " Vector cursor used to track position in the vector"]
    #[doc = "embedded in the associated bufvec."]
    pub bc_vc: m0_vec_cursor,
}
#[test]
fn bindgen_test_layout_m0_bufvec_cursor() {
    assert_eq!(
        ::std::mem::size_of::<m0_bufvec_cursor>(),
        24usize,
        concat!("Size of: ", stringify!(m0_bufvec_cursor))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_bufvec_cursor>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_bufvec_cursor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_bufvec_cursor>())).bc_vc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_bufvec_cursor),
            "::",
            stringify!(bc_vc)
        )
    );
}
extern "C" {
    #[doc = "Initialize a struct m0_bufvec cursor."]
    #[doc = "@param cur Pointer to the struct m0_bufvec_cursor."]
    #[doc = "@param bvec Pointer to the struct m0_bufvec."]
    pub fn m0_bufvec_cursor_init(cur: *mut m0_bufvec_cursor, bvec: *const m0_bufvec);
}
extern "C" {
    #[doc = "Advance the cursor \"count\" bytes further through the buffer vector."]
    #[doc = "@see m0_vec_cursor_move()"]
    #[doc = "@param cur Pointer to the struct m0_bufvec_cursor."]
    #[doc = "@return true, iff the end of the vector has been reached while moving. The"]
    #[doc = "cursor is in end of the vector position in this case."]
    #[doc = "@return false otherwise"]
    pub fn m0_bufvec_cursor_move(cur: *mut m0_bufvec_cursor, count: m0_bcount_t) -> bool;
}
extern "C" {
    #[doc = "Advances the cursor with some count such that cursor will be aligned to"]
    #[doc = "\"alignment\"."]
    #[doc = "Return convention is same as m0_bufvec_cursor_move()."]
    pub fn m0_bufvec_cursor_align(cur: *mut m0_bufvec_cursor, alignment: u64) -> bool;
}
extern "C" {
    #[doc = "Return number of bytes that the cursor have to be moved to reach the next"]
    #[doc = "segment in its vector (or to move into end of the vector position, when the"]
    #[doc = "cursor is already at the last segment)."]
    #[doc = ""]
    #[doc = "@pre !m0_bufvec_cursor_move(cur, 0)"]
    #[doc = "@see m0_vec_cursor_step()"]
    #[doc = "@param cur Pointer to the struct m0_bufvec_cursor."]
    #[doc = "@retval Count"]
    pub fn m0_bufvec_cursor_step(cur: *const m0_bufvec_cursor) -> m0_bcount_t;
}
extern "C" {
    #[doc = "Return the buffer address at the cursor's current position."]
    #[doc = "@pre !m0_bufvec_cursor_move(cur, 0)"]
    #[doc = "@see m0_bufvec_cursor_copy()"]
    #[doc = "@param cur Pointer to the struct m0_bufvec_cursor."]
    #[doc = "@retval Pointer into buffer."]
    pub fn m0_bufvec_cursor_addr(cur: *mut m0_bufvec_cursor) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Copy bytes from one buffer to another using cursors."]
    #[doc = "Both cursors are advanced by the number of bytes copied."]
    #[doc = "@param dcur Pointer to the destination buffer cursor positioned"]
    #[doc = "appropriately."]
    #[doc = "@param scur Pointer to the source buffer cursor positioned appropriately."]
    #[doc = "@param num_bytes The number of bytes to copy."]
    #[doc = "@retval bytes_copied The number of bytes actually copied. This will be equal"]
    #[doc = "to num_bytes only if there was adequate space in the buffers."]
    pub fn m0_bufvec_cursor_copy(
        dcur: *mut m0_bufvec_cursor,
        scur: *mut m0_bufvec_cursor,
        num_bytes: m0_bcount_t,
    ) -> m0_bcount_t;
}
extern "C" {
    #[doc = "Copy data with specified size to a cursor."]
    #[doc = "@param dcur Pointer to the destination buffer cursor positioned"]
    #[doc = "appropriately."]
    #[doc = "@param sdata Pointer to area where the data is to be copied from."]
    #[doc = "@param num_bytes The number of bytes to copy."]
    pub fn m0_bufvec_cursor_copyto(
        dcur: *mut m0_bufvec_cursor,
        sdata: *mut ::std::os::raw::c_void,
        num_bytes: m0_bcount_t,
    ) -> m0_bcount_t;
}
extern "C" {
    #[doc = "Copy data with specified size from a cursor."]
    #[doc = "@param scur Pointer to the source buffer cursor positioned appropriately."]
    #[doc = "@param ddata Pointer to area where the data is to be copied to."]
    #[doc = "@param num_bytes The number of bytes to copy."]
    pub fn m0_bufvec_cursor_copyfrom(
        scur: *mut m0_bufvec_cursor,
        ddata: *mut ::std::os::raw::c_void,
        num_bytes: m0_bcount_t,
    ) -> m0_bcount_t;
}
extern "C" {
    #[doc = " Compares contents of cursors. Return value the same as in memcmp(3)."]
    #[doc = ""]
    #[doc = " The positions of the cursors after the call are undefined."]
    pub fn m0_bufvec_cursor_cmp(
        c0: *mut m0_bufvec_cursor,
        c1: *mut m0_bufvec_cursor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Returns the length of the common prefix of 2 cursors."]
    #[doc = ""]
    #[doc = " The positions of the cursors after the call are undefined."]
    pub fn m0_bufvec_cursor_prefix(
        c0: *mut m0_bufvec_cursor,
        c1: *mut m0_bufvec_cursor,
    ) -> m0_bcount_t;
}
#[doc = "Mechanism to traverse given index vector (m0_indexvec)"]
#[doc = "keeping track of segment counts and vector boundary."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_ivec_cursor {
    pub ic_cur: m0_vec_cursor,
}
#[test]
fn bindgen_test_layout_m0_ivec_cursor() {
    assert_eq!(
        ::std::mem::size_of::<m0_ivec_cursor>(),
        24usize,
        concat!("Size of: ", stringify!(m0_ivec_cursor))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_ivec_cursor>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_ivec_cursor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_ivec_cursor>())).ic_cur as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_ivec_cursor),
            "::",
            stringify!(ic_cur)
        )
    );
}
extern "C" {
    #[doc = "Initialize given index vector cursor."]
    #[doc = "@param cur  Given index vector cursor."]
    #[doc = "@param ivec Given index vector to be associated with cursor."]
    pub fn m0_ivec_cursor_init(cur: *mut m0_ivec_cursor, ivec: *const m0_indexvec);
}
extern "C" {
    #[doc = "Moves the index vector cursor forward by @count."]
    #[doc = "@param cur   Given index vector cursor."]
    #[doc = "@param count Count by which cursor has to be moved."]
    #[doc = "@ret   true  iff end of vector has been reached while"]
    #[doc = "moving cursor by @count. Returns false otherwise."]
    pub fn m0_ivec_cursor_move(cur: *mut m0_ivec_cursor, count: m0_bcount_t) -> bool;
}
extern "C" {
    #[doc = " Moves index vector cursor forward until it reaches index @dest."]
    #[doc = " @pre   dest >= m0_ivec_cursor_index(cursor)."]
    #[doc = " @param dest Index uptil which cursor has to be moved."]
    #[doc = " @ret   true iff end of vector has been reached while"]
    #[doc = "             moving cursor. Returns false otherwise."]
    pub fn m0_ivec_cursor_move_to(cursor: *mut m0_ivec_cursor, dest: m0_bindex_t) -> bool;
}
extern "C" {
    #[doc = " Returns the number of bytes needed to move cursor to next segment in given"]
    #[doc = " index vector."]
    #[doc = " @param cur Index vector to be moved."]
    pub fn m0_ivec_cursor_step(cur: *const m0_ivec_cursor) -> m0_bcount_t;
}
extern "C" {
    #[doc = " Returns index at current cursor position."]
    #[doc = " @param cur Given index vector cursor."]
    pub fn m0_ivec_cursor_index(cur: *const m0_ivec_cursor) -> m0_bindex_t;
}
extern "C" {
    #[doc = " Returns the latest index through the contiguous segments up to @dest."]
    #[doc = " @pre   dest >= m0_ivec_cursor_index(cur)."]
    #[doc = " @param cur cursor to start from."]
    #[doc = " @param dest uptil where to check."]
    pub fn m0_ivec_cursor_conti(cur: *const m0_ivec_cursor, dest: m0_bindex_t) -> m0_bindex_t;
}
#[doc = "Zero vector is a full fledged IO vector containing IO extents"]
#[doc = "as well as the IO buffers."]
#[doc = "An invariant (m0_0vec_invariant) is maintained for m0_0vec. It"]
#[doc = "always checks sanity of zero vector and keeps a bound check on"]
#[doc = "array of IO buffers by checking buffer alignment and count check."]
#[doc = ""]
#[doc = "Zero vector is typically allocated by upper layer by following"]
#[doc = "the bounds of network layer (max buffer size, max segments,"]
#[doc = "max seg size) and adds buffers/pages later as and when needed."]
#[doc = "Size of z_index array is same as array of buffer addresses and"]
#[doc = "array of segment counts."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_0vec {
    #[doc = " Bufvec representing extent of IO vector and array of buffers."]
    pub z_bvec: m0_bufvec,
    #[doc = " Array of indices of target object to start IO from."]
    pub z_index: *mut m0_bindex_t,
    #[doc = " Stores last buffer index."]
    pub z_last_buf_idx: m0_bindex_t,
    #[doc = " Count of data buffers added to the zero vec."]
    pub z_count: m0_bcount_t,
}
#[test]
fn bindgen_test_layout_m0_0vec() {
    assert_eq!(
        ::std::mem::size_of::<m0_0vec>(),
        48usize,
        concat!("Size of: ", stringify!(m0_0vec))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_0vec>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_0vec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_0vec>())).z_bvec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_0vec),
            "::",
            stringify!(z_bvec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_0vec>())).z_index as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_0vec),
            "::",
            stringify!(z_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_0vec>())).z_last_buf_idx as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_0vec),
            "::",
            stringify!(z_last_buf_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_0vec>())).z_count as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_0vec),
            "::",
            stringify!(z_count)
        )
    );
}
pub const M0_0VEC_SHIFT: ::std::os::raw::c_uint = 12;
pub const M0_0VEC_ALIGN: ::std::os::raw::c_uint = 4096;
pub const M0_0VEC_MASK: ::std::os::raw::c_uint = 4095;
pub const M0_SEG_SHIFT: ::std::os::raw::c_uint = 12;
pub const M0_SEG_SIZE: ::std::os::raw::c_uint = 4096;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
extern "C" {
    #[doc = "Initialize a pre-allocated m0_0vec structure."]
    #[doc = "@pre zvec != NULL."]
    #[doc = "@param zvec The m0_0vec structure to be initialized."]
    #[doc = "@param segs_nr Number of segments in zero vector."]
    #[doc = "@post zvec->z_bvec.ov_buf != NULL &&"]
    #[doc = "zvec->z_bvec.ov_vec.v_nr != 0 &&"]
    #[doc = "zvec->z_bvec.ov_vec.v_count != NULL &&"]
    #[doc = "zvec->z_index != NULL"]
    pub fn m0_0vec_init(zvec: *mut m0_0vec, segs_nr: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Finalize a m0_0vec structure."]
    #[doc = "@param The m0_0vec structure to be deallocated."]
    #[doc = "@see m0_0vec_init()."]
    pub fn m0_0vec_fini(zvec: *mut m0_0vec);
}
extern "C" {
    #[doc = "Init the m0_0vec structure from given m0_bufvec structure and"]
    #[doc = "array of indices."]
    #[doc = "This API does not copy data. Only pointers are copied."]
    #[doc = "@pre zvec != NULL && bufvec != NULL && indices != NULL."]
    #[doc = "@param zvec The m0_0vec structure to be initialized."]
    #[doc = "@param bufvec The m0_bufvec containing buffer starting addresses and"]
    #[doc = "with number of buffers and their byte counts."]
    #[doc = "@param indices Target object indices to start the IO from."]
    #[doc = "@post m0_0vec_invariant(zvec)."]
    pub fn m0_0vec_bvec_init(
        zvec: *mut m0_0vec,
        bufvec: *const m0_bufvec,
        indices: *const m0_bindex_t,
    );
}
extern "C" {
    #[doc = "Init the m0_0vec structure from array of buffers with indices and counts."]
    #[doc = "This API does not copy data. Just pointers are copied."]
    #[doc = "@note The m0_0vec struct should be allocated by user."]
    #[doc = ""]
    #[doc = "@param zvec The m0_0vec structure to be initialized."]
    #[doc = "@param bufs Array of IO buffers."]
    #[doc = "@param indices Array of target object indices."]
    #[doc = "@param counts Array of buffer counts."]
    #[doc = "@param segs_nr Number of segments contained in the buf array."]
    #[doc = "@post m0_0vec_invariant(zvec)."]
    pub fn m0_0vec_bufs_init(
        zvec: *mut m0_0vec,
        bufs: *mut *mut ::std::os::raw::c_void,
        indices: *const m0_bindex_t,
        counts: *const m0_bcount_t,
        segs_nr: u32,
    );
}
extern "C" {
    #[doc = "Add a m0_buf structure at given target index to m0_0vec structure."]
    #[doc = "@note The m0_0vec struct should be allocated by user."]
    #[doc = ""]
    #[doc = "@param zvec The m0_0vec structure to be initialized."]
    #[doc = "@param buf The m0_buf structure containing starting address of buffer"]
    #[doc = "and number of bytes in buffer."]
    #[doc = "@param index Index of target object to start IO from."]
    #[doc = "@post m0_0vec_invariant(zvec)."]
    pub fn m0_0vec_cbuf_add(
        zvec: *mut m0_0vec,
        buf: *const m0_buf,
        index: *const m0_bindex_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Helper functions to copy opaque data with specified size to and from a"]
    #[doc = " m0_bufvec"]
    pub fn m0_data_to_bufvec_copy(
        cur: *mut m0_bufvec_cursor,
        data: *mut ::std::os::raw::c_void,
        len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m0_bufvec_to_data_copy(
        cur: *mut m0_bufvec_cursor,
        data: *mut ::std::os::raw::c_void,
        len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m0_bufvec_copy(
        dst: *mut m0_bufvec,
        src: *mut m0_bufvec,
        num_bytes: m0_bcount_t,
    ) -> m0_bcount_t;
}
#[doc = " Represents the extent information for an io segment. m0_ioseg typically"]
#[doc = " represents a user space data buffer or a kernel page."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_ioseg {
    pub ci_index: u64,
    pub ci_count: u64,
}
#[test]
fn bindgen_test_layout_m0_ioseg() {
    assert_eq!(
        ::std::mem::size_of::<m0_ioseg>(),
        16usize,
        concat!("Size of: ", stringify!(m0_ioseg))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_ioseg>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_ioseg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_ioseg>())).ci_index as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_ioseg),
            "::",
            stringify!(ci_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_ioseg>())).ci_count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_ioseg),
            "::",
            stringify!(ci_count)
        )
    );
}
#[doc = " Represents an index vector with {index, count}  tuples for a target"]
#[doc = " device (typically a cob)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_io_indexvec {
    pub ci_nr: u32,
    pub ci_iosegs: *mut m0_ioseg,
}
#[test]
fn bindgen_test_layout_m0_io_indexvec() {
    assert_eq!(
        ::std::mem::size_of::<m0_io_indexvec>(),
        16usize,
        concat!("Size of: ", stringify!(m0_io_indexvec))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_io_indexvec>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_io_indexvec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_io_indexvec>())).ci_nr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_io_indexvec),
            "::",
            stringify!(ci_nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_io_indexvec>())).ci_iosegs as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_io_indexvec),
            "::",
            stringify!(ci_iosegs)
        )
    );
}
#[doc = " Represents sequence of index vector, one per network buffer."]
#[doc = " As a result of io coalescing, there could be multiple network"]
#[doc = " buffers associated with an io fop. Hence a SEQUENCE of m0_io_indexvec"]
#[doc = " is needed, one per network buffer."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_io_indexvec_seq {
    pub cis_nr: u32,
    pub cis_ivecs: *mut m0_io_indexvec,
}
#[test]
fn bindgen_test_layout_m0_io_indexvec_seq() {
    assert_eq!(
        ::std::mem::size_of::<m0_io_indexvec_seq>(),
        16usize,
        concat!("Size of: ", stringify!(m0_io_indexvec_seq))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_io_indexvec_seq>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_io_indexvec_seq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_io_indexvec_seq>())).cis_nr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_io_indexvec_seq),
            "::",
            stringify!(cis_nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_io_indexvec_seq>())).cis_ivecs as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_io_indexvec_seq),
            "::",
            stringify!(cis_ivecs)
        )
    );
}
extern "C" {
    pub fn m0_io_count(io_info: *const m0_io_indexvec) -> m0_bcount_t;
}
extern "C" {
    #[doc = " Function to split the indexvec from the given offset to the lenth specified."]
    #[doc = ""]
    #[doc = " @param mem_ivec Indexvec memory format."]
    #[doc = " @param curr_pos Start position for new indexvec."]
    #[doc = " @param nb_len Size of the data for new indexvec."]
    #[doc = " @param bshift Shift value for the data to align index vecs."]
    #[doc = ""]
    #[doc = " @pre in != NULL"]
    #[doc = " @pre out != NULL"]
    pub fn m0_indexvec_split(
        in_: *mut m0_indexvec,
        curr_pos: m0_bcount_t,
        nb_len: m0_bcount_t,
        bshift: u32,
        out: *mut m0_indexvec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Function to convert the on-wire indexvec to in-memory indexvec format.  Since"]
    #[doc = " m0_io_indexvec (on-wire structure) and m0_indexvec (in-memory structures are"]
    #[doc = " different, conversion is needed."]
    #[doc = ""]
    #[doc = " @param wire_ivec Indexvec wire format."]
    #[doc = " @param mem_ivec Indexvec memory format."]
    #[doc = " @param max_frags_nr Number of fragments from the wire_ivec."]
    #[doc = ""]
    #[doc = " @pre wire_ive != NULL"]
    #[doc = " @pre mem_ivec != NULL"]
    pub fn m0_indexvec_wire2mem(
        wire_ivec: *mut m0_io_indexvec,
        max_frags_nr: ::std::os::raw::c_int,
        bshift: u32,
        mem_ivec: *mut m0_indexvec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m0_indexvec_mem2wire(
        mem_ivec: *mut m0_indexvec,
        max_frags_nr: ::std::os::raw::c_int,
        bshift: u32,
        wire_ivec: *mut m0_io_indexvec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Creates an indexvec with a single extent, which spans the range [0. ~0)."]
    #[doc = " Since the range spanned by this indexvec represents union of all possible"]
    #[doc = " ranges that any indexvec can hold, it is referred as a universal indexvec."]
    #[doc = " @param iv  Input indexvec."]
    pub fn m0_indexvec_universal_set(iv: *mut m0_indexvec) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Returns true if the input indexvec is universal."]
    pub fn m0_indexvec_is_universal(iv: *const m0_indexvec) -> bool;
}
#[doc = " Vector of extents stored in m0_varr"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_indexvec_varr {
    #[doc = " Number of extents and their sizes."]
    pub iv_count: m0_varr,
    #[doc = " Array of starting extent indices, with the same size of iv_count."]
    pub iv_index: m0_varr,
    #[doc = " number of used elements, set by users"]
    pub iv_nr: u32,
}
#[test]
fn bindgen_test_layout_m0_indexvec_varr() {
    assert_eq!(
        ::std::mem::size_of::<m0_indexvec_varr>(),
        1208usize,
        concat!("Size of: ", stringify!(m0_indexvec_varr))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_indexvec_varr>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_indexvec_varr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_indexvec_varr>())).iv_count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_indexvec_varr),
            "::",
            stringify!(iv_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_indexvec_varr>())).iv_index as *const _ as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_indexvec_varr),
            "::",
            stringify!(iv_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_indexvec_varr>())).iv_nr as *const _ as usize },
        1200usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_indexvec_varr),
            "::",
            stringify!(iv_nr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_ivec_varr_cursor {
    pub vc_ivv: *mut m0_indexvec_varr,
    #[doc = " Segment that the cursor is currently in."]
    pub vc_seg: u32,
    #[doc = " Offset within the segment that the cursor is positioned at."]
    pub vc_offset: m0_bcount_t,
}
#[test]
fn bindgen_test_layout_m0_ivec_varr_cursor() {
    assert_eq!(
        ::std::mem::size_of::<m0_ivec_varr_cursor>(),
        24usize,
        concat!("Size of: ", stringify!(m0_ivec_varr_cursor))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_ivec_varr_cursor>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_ivec_varr_cursor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_ivec_varr_cursor>())).vc_ivv as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_ivec_varr_cursor),
            "::",
            stringify!(vc_ivv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_ivec_varr_cursor>())).vc_seg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_ivec_varr_cursor),
            "::",
            stringify!(vc_seg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_ivec_varr_cursor>())).vc_offset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_ivec_varr_cursor),
            "::",
            stringify!(vc_offset)
        )
    );
}
extern "C" {
    #[doc = " Allocates memory in m0_varr for index array and counts array in index vector."]
    #[doc = " @param len Number of elements to allocate memory for."]
    #[doc = " @pre   ivec != NULL && len > 0."]
    #[doc = " @ret   return 0 iff memory allocation succeeds. -ENOMEM on failure."]
    pub fn m0_indexvec_varr_alloc(ivec: *mut m0_indexvec_varr, len: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Deallocates the memory buffers in m0_varr."]
    #[doc = " @pre  ivec != NULL."]
    pub fn m0_indexvec_varr_free(ivec: *mut m0_indexvec_varr);
}
extern "C" {
    #[doc = " Initializes given index vector cursor."]
    #[doc = " @param cur  Given index vector cursor."]
    #[doc = " @param ivec Given index vector to be associated with cursor."]
    pub fn m0_ivec_varr_cursor_init(cur: *mut m0_ivec_varr_cursor, ivec: *mut m0_indexvec_varr);
}
extern "C" {
    #[doc = " Moves the index vector cursor forward by @count."]
    #[doc = " @param cur   Given index vector cursor."]
    #[doc = " @param count Count by which cursor has to be moved."]
    #[doc = " @ret   true  iff end of vector has been reached while"]
    #[doc = "              moving cursor by @count. Returns false otherwise."]
    pub fn m0_ivec_varr_cursor_move(cur: *mut m0_ivec_varr_cursor, count: m0_bcount_t) -> bool;
}
extern "C" {
    #[doc = " Moves index vector cursor forward until it reaches index @dest."]
    #[doc = " @pre   dest >= m0_ivec_cursor_index(cursor)."]
    #[doc = " @param dest Index uptil which cursor has to be moved."]
    #[doc = " @ret   true iff end of vector has been reached while"]
    #[doc = "             moving cursor. Returns false otherwise."]
    #[doc = " @post  m0_ivec_varr_cursor_index(cursor) == to."]
    pub fn m0_ivec_varr_cursor_move_to(cur: *mut m0_ivec_varr_cursor, dest: m0_bindex_t) -> bool;
}
extern "C" {
    #[doc = " Returns the number of bytes needed to move cursor to next segment in given"]
    #[doc = " index vector."]
    #[doc = " @param cur Index vector to be moved."]
    #[doc = " @ret   Number of bytes needed to move the cursor to next segment."]
    pub fn m0_ivec_varr_cursor_step(cur: *const m0_ivec_varr_cursor) -> m0_bcount_t;
}
extern "C" {
    #[doc = " Returns index at current cursor position."]
    #[doc = " @param cur Given index vector cursor."]
    #[doc = " @ret   Index at current cursor position."]
    pub fn m0_ivec_varr_cursor_index(cur: *const m0_ivec_varr_cursor) -> m0_bindex_t;
}
extern "C" {
    #[doc = " Returns the latest index through the contiguous segments up to @dest."]
    #[doc = " @pre   dest >= m0_ivec_varr_cursor_index(cur)."]
    #[doc = " @param cur cursor to start from."]
    #[doc = " @param dest uptil where to check."]
    pub fn m0_ivec_varr_cursor_conti(
        cur: *const m0_ivec_varr_cursor,
        dest: m0_bindex_t,
    ) -> m0_bindex_t;
}
#[doc = "@addtogroup atomic"]
#[doc = ""]
#[doc = "Implementation of atomic operations for Linux user space uses x86_64 assembly"]
#[doc = "language instructions (with gcc syntax). \"Lock\" prefix is used"]
#[doc = "everywhere---no optimisation for non-SMP configurations in present."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_atomic64 {
    pub a_value: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_m0_atomic64() {
    assert_eq!(
        ::std::mem::size_of::<m0_atomic64>(),
        8usize,
        concat!("Size of: ", stringify!(m0_atomic64))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_atomic64>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_atomic64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_atomic64>())).a_value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_atomic64),
            "::",
            stringify!(a_value)
        )
    );
}
#[doc = "@defgroup time Generic time manipulation"]
#[doc = ""]
#[doc = "M0 time delivers resolution in nanoseconds. It is an unsigned 64-bit integer."]
#[doc = "@{"]
pub type m0_time_t = u64;
pub const M0_TIME_ONE_SECOND: ::std::os::raw::c_uint = 1000000000;
pub const M0_TIME_ONE_MSEC: ::std::os::raw::c_uint = 1000000;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
extern "C" {
    #[doc = "Special value of abs_timeout indicates that action should be performed"]
    #[doc = "immediately"]
    pub static M0_TIME_IMMEDIATELY: m0_time_t;
}
extern "C" {
    #[doc = " The largest time that is never reached in system life."]
    pub static M0_TIME_NEVER: m0_time_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_hour as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mday as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mon as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_year as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_wday as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_yday as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_isdst as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_gmtoff as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_zone as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(
        ::std::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerspec>())).it_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerspec>())).it_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: size_t,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> size_t;
}
extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: size_t,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: __locale_t,
    ) -> size_t;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub fn stime(__when: *const time_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub const CLOCK_SOURCES_M0_CLOCK_SOURCE_REALTIME: CLOCK_SOURCES = 0;
pub const CLOCK_SOURCES_M0_CLOCK_SOURCE_MONOTONIC: CLOCK_SOURCES = 1;
#[doc = " @note POSIX timers on Linux don't support this clock source"]
pub const CLOCK_SOURCES_M0_CLOCK_SOURCE_MONOTONIC_RAW: CLOCK_SOURCES = 4;
#[doc = " gettimeofday(). All others clock sources use clock_gettime()"]
pub const CLOCK_SOURCES_M0_CLOCK_SOURCE_GTOD: CLOCK_SOURCES = 5;
#[doc = " CLOCK_REALTIME + CLOCK_MONOTONIC combination."]
#[doc = "  @see m0_utime_init()"]
pub const CLOCK_SOURCES_M0_CLOCK_SOURCE_REALTIME_MONOTONIC: CLOCK_SOURCES = 6;
#[doc = " Clock sources for m0_time_now(). @see m0_time_now()"]
#[doc = " @note Be sure to change m0_semaphore and m0_timer implementations"]
#[doc = " after changing CLOCK_SOURCES list."]
#[doc = " @see man 3p clock_gettime"]
#[doc = " @see timer_posix_set(), m0_semaphore_timeddown(), m0_time_now(),"]
#[doc = "\tm0_time_to_realtime()."]
pub type CLOCK_SOURCES = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Clock source for m0_time_now()"]
    pub static M0_CLOCK_SOURCE: CLOCK_SOURCES;
}
extern "C" {
    #[doc = " Offset for M0_CLOCK_SOURCE_REALTIME_MONOTONIC clock source."]
    #[doc = "  @see m0_utime_init()"]
    pub static mut m0_time_monotonic_offset: m0_time_t;
}
extern "C" {
    #[doc = " Useful for mutex/semaphore implementation. This function will translate"]
    #[doc = " time from value obtained from m0_time_now() to value that can be used"]
    #[doc = " with CLOCK_REALTIME-only functions such as sem_timedwait() and"]
    #[doc = " pthread_mutex_timedlock()."]
    #[doc = " @param time Time obtained from m0_time_now() and adjusted somehow if needed."]
    #[doc = " @return Converted time value."]
    #[doc = " @note In some cases this function will have 2 calls to clock_gettime()."]
    pub fn m0_time_to_realtime(abs_time: m0_time_t) -> m0_time_t;
}
extern "C" {
    #[doc = " Create and return a m0_time_t from seconds and nanoseconds."]
    pub fn m0_time(secs: u64, ns: ::std::os::raw::c_long) -> m0_time_t;
}
extern "C" {
    #[doc = " Get the current time.  This may or may not relate to wall time."]
    pub fn m0_time_now() -> m0_time_t;
}
extern "C" {
    #[doc = "Create a m0_time_t initialised with seconds + nanosecond in the future."]
    #[doc = ""]
    #[doc = "@param secs seconds from now"]
    #[doc = "@param ns nanoseconds from now"]
    #[doc = ""]
    #[doc = "@return The result time."]
    pub fn m0_time_from_now(secs: u64, ns: ::std::os::raw::c_long) -> m0_time_t;
}
extern "C" {
    #[doc = "Add t2 to t1 and return that result."]
    #[doc = ""]
    #[doc = "@return The result time. If either t1 or t2 is M0_TIME_NEVER, the result"]
    #[doc = "is M0_TIME_NEVER."]
    pub fn m0_time_add(t1: m0_time_t, t2: m0_time_t) -> m0_time_t;
}
extern "C" {
    #[doc = "Subtract t2 from t1 and return that result."]
    #[doc = ""]
    #[doc = "@return The result time. If t1 == M0_TIME_NEVER, M0_TIME_NEVER is returned."]
    #[doc = "@pre t2 < M0_TIME_NEVER && t1 >= t2"]
    pub fn m0_time_sub(t1: m0_time_t, t2: m0_time_t) -> m0_time_t;
}
extern "C" {
    #[doc = "Sleep for requested time. If interrupted, remaining time returned."]
    #[doc = ""]
    #[doc = "@param req requested time to sleep"]
    #[doc = "@param rem [OUT] remaining time, NULL causes remaining time to be ignored."]
    #[doc = "@return 0 means success. -1 means error. Remaining time is stored in rem."]
    pub fn m0_nanosleep(req: m0_time_t, rem: *mut m0_time_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get \"second\" part from the time."]
    pub fn m0_time_seconds(time: m0_time_t) -> u64;
}
extern "C" {
    #[doc = " Get \"nanosecond\" part from the time."]
    pub fn m0_time_nanoseconds(time: m0_time_t) -> u64;
}
extern "C" {
    pub fn m0_time_is_in_past(time: m0_time_t) -> bool;
}
#[doc = "List entry."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_list_link {
    #[doc = " Next entry in the list"]
    pub ll_next: *mut m0_list_link,
    #[doc = " Previous entry in the list"]
    pub ll_prev: *mut m0_list_link,
}
#[test]
fn bindgen_test_layout_m0_list_link() {
    assert_eq!(
        ::std::mem::size_of::<m0_list_link>(),
        16usize,
        concat!("Size of: ", stringify!(m0_list_link))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_list_link>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_list_link))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_list_link>())).ll_next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_list_link),
            "::",
            stringify!(ll_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_list_link>())).ll_prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_list_link),
            "::",
            stringify!(ll_prev)
        )
    );
}
extern "C" {
    #[doc = "initialize list link entry"]
    #[doc = ""]
    #[doc = "It is not necessary to call this function if the first operation on the link is"]
    #[doc = "any of m0_list_add*() functions."]
    #[doc = ""]
    #[doc = "@param link - pointer to link enty"]
    pub fn m0_list_link_init(link: *mut m0_list_link);
}
extern "C" {
    #[doc = "free resources associated with link entry"]
    #[doc = ""]
    #[doc = "@param link - pointer to link enty"]
    pub fn m0_list_link_fini(link: *mut m0_list_link);
}
extern "C" {
    pub fn m0_list_link_invariant(link: *const m0_list_link) -> bool;
}
#[doc = "List head."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_list {
    #[doc = " Pointer to the first entry in the list."]
    pub l_head: *mut m0_list_link,
    #[doc = " Pointer to the last entry in the list."]
    pub l_tail: *mut m0_list_link,
}
#[test]
fn bindgen_test_layout_m0_list() {
    assert_eq!(
        ::std::mem::size_of::<m0_list>(),
        16usize,
        concat!("Size of: ", stringify!(m0_list))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_list>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_list>())).l_head as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_list),
            "::",
            stringify!(l_head)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_list>())).l_tail as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_list),
            "::",
            stringify!(l_tail)
        )
    );
}
extern "C" {
    #[doc = "Initializes list head."]
    pub fn m0_list_init(head: *mut m0_list);
}
extern "C" {
    #[doc = "Finalizes the list."]
    pub fn m0_list_fini(head: *mut m0_list);
}
extern "C" {
    #[doc = "check list is empty"]
    #[doc = ""]
    #[doc = "@param head pointer to list head"]
    pub fn m0_list_is_empty(head: *const m0_list) -> bool;
}
extern "C" {
    #[doc = "Returns true iff @link is in @list."]
    pub fn m0_list_contains(list: *const m0_list, link: *const m0_list_link) -> bool;
}
extern "C" {
    #[doc = "This function iterate over the argument list checking that double-linked"]
    #[doc = "list invariant holds (x->ll_prev->ll_next == x && x->ll_next->ll_prev == x)."]
    #[doc = ""]
    #[doc = "@return true iff @list isn't corrupted"]
    pub fn m0_list_invariant(list: *const m0_list) -> bool;
}
extern "C" {
    pub fn m0_list_length(list: *const m0_list) -> size_t;
}
extern "C" {
    #[doc = "add list to top on the list"]
    #[doc = ""]
    #[doc = "This function can be called on an uninitialised @next link. All @next fields are"]
    #[doc = "overwritten."]
    #[doc = ""]
    #[doc = "@param head pointer to list head"]
    #[doc = "@param next  pointer to list entry"]
    #[doc = ""]
    pub fn m0_list_add(head: *mut m0_list, next: *mut m0_list_link);
}
extern "C" {
    #[doc = "add list to tail on the list"]
    #[doc = ""]
    #[doc = "This function can be called on an uninitialised @next link. All @next fields are"]
    #[doc = "overwritten."]
    #[doc = ""]
    #[doc = "@param head pointer to list head"]
    #[doc = "@param next  pointer to list entry"]
    pub fn m0_list_add_tail(head: *mut m0_list, next: *mut m0_list_link);
}
extern "C" {
    #[doc = "Adds an element to the list right after the specified element."]
    #[doc = ""]
    #[doc = "This function can be called on an uninitialised @next link. All @next fields"]
    #[doc = "are overwritten."]
    pub fn m0_list_add_after(anchor: *mut m0_list_link, next: *mut m0_list_link);
}
extern "C" {
    #[doc = "Adds an element to the list right before the specified element."]
    #[doc = ""]
    #[doc = "This function can be called on an uninitialised @next link. All @next fields"]
    #[doc = "are overwritten."]
    pub fn m0_list_add_before(anchor: *mut m0_list_link, next: *mut m0_list_link);
}
extern "C" {
    #[doc = "Deletes an entry from the list and re-initializes the entry."]
    pub fn m0_list_del(old: *mut m0_list_link);
}
extern "C" {
    #[doc = "Moves an entry to head of the list."]
    pub fn m0_list_move(head: *mut m0_list, next: *mut m0_list_link);
}
extern "C" {
    #[doc = "Moves an entry to tail of the list."]
    pub fn m0_list_move_tail(head: *mut m0_list, next: *mut m0_list_link);
}
extern "C" {
    #[doc = "is link entry connected to the list"]
    #[doc = ""]
    #[doc = "@param link - pointer to link entry"]
    #[doc = ""]
    #[doc = "@retval true - entry connected to a list"]
    #[doc = "@retval false - entry disconnected from a list"]
    pub fn m0_list_link_is_in(link: *const m0_list_link) -> bool;
}
extern "C" {
    pub fn m0_list_link_is_last(link: *const m0_list_link, head: *const m0_list) -> bool;
}
#[doc = " Enum descriptor."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_xcode_enum {
    #[doc = " Name of the enum type."]
    pub xe_name: *const ::std::os::raw::c_char,
    #[doc = " Number of constants in the type."]
    pub xe_nr: u32,
    #[doc = " Array of constant descriptors."]
    #[doc = ""]
    #[doc = " This array contains (self->xe_nr + 1) element. The last element is"]
    #[doc = " a sentinel, see xcode/enum.c:valget()."]
    pub xe_val: *const m0_xcode_enum_val,
    #[doc = " Maximal among constant name (m0_xcode_enum_val::xev_name) lengths for"]
    #[doc = " this type."]
    #[doc = ""]
    #[doc = " This is useful for formatting."]
    pub xe_maxlen: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_m0_xcode_enum() {
    assert_eq!(
        ::std::mem::size_of::<m0_xcode_enum>(),
        32usize,
        concat!("Size of: ", stringify!(m0_xcode_enum))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_xcode_enum>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_xcode_enum))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_enum>())).xe_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_enum),
            "::",
            stringify!(xe_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_enum>())).xe_nr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_enum),
            "::",
            stringify!(xe_nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_enum>())).xe_val as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_enum),
            "::",
            stringify!(xe_val)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_enum>())).xe_maxlen as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_enum),
            "::",
            stringify!(xe_maxlen)
        )
    );
}
#[doc = " @defgroup xcode"]
#[doc = ""]
#[doc = " Enumeration support in xcode"]
#[doc = " ----------------------------"]
#[doc = ""]
#[doc = " xcode provides a rudimentary support for enumeration (enum) reflection."]
#[doc = ""]
#[doc = " A enumeration type is represented by an instance of m0_xcode_enum structure,"]
#[doc = " which contains an array (m0_xcode_enum::xe_val[]) of m0_xcode_enum_val"]
#[doc = " structures describing all valid enumeration constants for the type."]
#[doc = ""]
#[doc = " xcode provides functions to convert enums between binary and symbolic form"]
#[doc = " (m0_xcode_enum_read() and m0_xcode_print()). In addition, a enum can be"]
#[doc = " interpreted as a set of bit-flags, OR-ed to construct bit-masks. Resulting"]
#[doc = " bit-masks can be parsed and printed by m0_xcode_bitmask_read() and"]
#[doc = " m0_xcode_bitmask_print()."]
#[doc = ""]
#[doc = " m0_xcode_enum representation is constructed automatically by the build"]
#[doc = " process for each enum declaration tagged with the M0_XCA_ENUM. This only"]
#[doc = " works for named enums."]
#[doc = ""]
#[doc = " @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_xcode_enum_val {
    #[doc = " The index, starting with 0, of the constant in the enum declaration."]
    #[doc = ""]
    #[doc = " The literally first constant within \"enum { ... }\" declaration gets"]
    #[doc = " index 0, the second---1 and so on."]
    #[doc = ""]
    #[doc = " The last element in the m0_xcode_enum::xe_val[] array is a sentinel"]
    #[doc = " with index -1."]
    pub xev_idx: ::std::os::raw::c_int,
    #[doc = " Constant value."]
    pub xev_val: u64,
    #[doc = " Symbolic constant name."]
    #[doc = ""]
    #[doc = " The sentinel element contains \"Invalid value of enum 'NAME'.\" string"]
    #[doc = " here, where NAME is m0_xcode_enum::xe_name."]
    pub xev_name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_m0_xcode_enum_val() {
    assert_eq!(
        ::std::mem::size_of::<m0_xcode_enum_val>(),
        24usize,
        concat!("Size of: ", stringify!(m0_xcode_enum_val))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_xcode_enum_val>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_xcode_enum_val))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_enum_val>())).xev_idx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_enum_val),
            "::",
            stringify!(xev_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_enum_val>())).xev_val as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_enum_val),
            "::",
            stringify!(xev_val)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_enum_val>())).xev_name as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_enum_val),
            "::",
            stringify!(xev_name)
        )
    );
}
extern "C" {
    pub fn m0_xcode_enum_is_valid(en: *const m0_xcode_enum, val: u64) -> bool;
}
extern "C" {
    #[doc = " Returns symbolic name for a enum constant."]
    #[doc = ""]
    #[doc = " If \"buf\" is NULL:"]
    #[doc = ""]
    #[doc = "     - this function always returns a static string;"]
    #[doc = ""]
    #[doc = "     - for an invalid value, a fixed (per enum type) string is returned (see"]
    #[doc = "       m0_xcode_enum_val::xev_name). This string does not depend on the value"]
    #[doc = "       and hence, cannot be parsed back by m0_xcode_enum_read()."]
    #[doc = ""]
    #[doc = " If \"buf\" is not NULL:"]
    #[doc = ""]
    #[doc = "     - valid values are processed as in (buf == NULL) case, that is, a static"]
    #[doc = "       string is returned;"]
    #[doc = ""]
    #[doc = "     - invalid value is snprintf-ed into buf in the sexadecimal form. The"]
    #[doc = "       buffer should be sufficiently large."]
    pub fn m0_xcode_enum_print(
        en: *const m0_xcode_enum,
        val: u64,
        buf: *mut ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Parses a symbolic enum constant name into the binary value."]
    #[doc = ""]
    #[doc = " \"buf\" should be a usual zero-terminated string. The function first tries to"]
    #[doc = " interpret first \"nr\" bytes as a symbolic name of a constant in the given"]
    #[doc = " enum. Failing that, the function tries to interpret first \"nr\" bytes of \"buf\""]
    #[doc = " as a sexadecimal representation of a value (potentially looking beyond \"nr\""]
    #[doc = " bytes in this case)."]
    pub fn m0_xcode_enum_read(
        en: *const m0_xcode_enum,
        buf: *const ::std::os::raw::c_char,
        nr: ::std::os::raw::c_int,
        val: *mut u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m0_xcode_bitmask_is_valid(en: *const m0_xcode_enum, val: u64) -> bool;
}
extern "C" {
    #[doc = " Outputs the symbolic name of a bitmask."]
    #[doc = ""]
    #[doc = " The general forms of the output, constructed in the first \"nr\" bytes of \"buf\""]
    #[doc = " are:"]
    #[doc = ""]
    #[doc = " @verbatim"]
    #[doc = "     CONST_0|CONST_1|...|CONST_N|REST"]
    #[doc = " @endverbatim"]
    #[doc = ""]
    #[doc = " @verbatim"]
    #[doc = "     CONST_0|CONST_1|...|CONST_N"]
    #[doc = " @endverbatim"]
    #[doc = ""]
    #[doc = " where CONST-s are symbolic names of set bits in the bitmask and REST is the"]
    #[doc = " sexadecimal representation of the remaining invalid bits that have no"]
    #[doc = " matching constants. The second form is used when m0_xcode_bitmask_is_valid()"]
    #[doc = " holds."]
    pub fn m0_xcode_bitmask_print(
        en: *const m0_xcode_enum,
        val: u64,
        buf: *mut ::std::os::raw::c_char,
        nr: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Parses the symbolic representation of the bitmask."]
    #[doc = ""]
    #[doc = " This function can parse the output of m0_xcode_bitmask_print(). And maybe"]
    #[doc = " more, but do not rely on it."]
    pub fn m0_xcode_bitmask_read(
        en: *const m0_xcode_enum,
        buf: *const ::std::os::raw::c_char,
        nr: ::std::os::raw::c_int,
        val: *mut u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Custom field reader for enums."]
    #[doc = ""]
    #[doc = " The pointer to this function is installed into m0_xcode_field::xf_read by"]
    #[doc = " m0gccxml2xcode for fields tagged with the M0_XCA_FENUM macro."]
    pub fn m0_xcode_enum_field_read(
        it: *const m0_xcode_cursor,
        obj: *mut m0_xcode_obj,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Custom field reader for bitmasks."]
    #[doc = ""]
    #[doc = " The pointer to this function is installed into m0_xcode_field::xf_read by"]
    #[doc = " m0gccxml2xcode for fields tagged with the M0_XCA_FBITMASK macro."]
    pub fn m0_xcode_bitmask_field_read(
        it: *const m0_xcode_cursor,
        obj: *mut m0_xcode_obj,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_xcode {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_xcode_field_ops {
    _unused: [u8; 0],
}
#[doc = "RECORD corresponds to C struct. Fields of RECORD type are located one"]
#[doc = "after another in memory."]
pub const m0_xcode_aggr_M0_XA_RECORD: m0_xcode_aggr = 0;
#[doc = "UNION corresponds to discriminated union. Its first field is referred"]
#[doc = "to as a \"discriminator\" and has an atomic type. Other fields of union"]
#[doc = "are tagged (m0_xcode_field::xf_tag) and the value of the"]
#[doc = "discriminator field determines which of the following fields is"]
#[doc = "actually used."]
#[doc = ""]
#[doc = "@note that, similarly to M0_XA_SEQUENCE, the discriminator field can"]
#[doc = "have M0_XAT_VOID type. In this case its tag is used instead of its"]
#[doc = "value (use cases are not clear)."]
pub const m0_xcode_aggr_M0_XA_UNION: m0_xcode_aggr = 1;
#[doc = "SEQUENCE corresponds to counted array. Sequence always has two"]
#[doc = "fields: a scalar \"counter\" field and a field denoting the element of"]
#[doc = "the array."]
#[doc = ""]
#[doc = "@note if counter has type M0_XAT_VOID, its tag used as a"]
#[doc = "counter. This is used to represent fixed size arrays without an"]
#[doc = "explicit counter field."]
pub const m0_xcode_aggr_M0_XA_SEQUENCE: m0_xcode_aggr = 2;
#[doc = "Array is a fixed size array. It always has a single field. The number"]
#[doc = "of elements in the array is recorded as the tag is this field."]
pub const m0_xcode_aggr_M0_XA_ARRAY: m0_xcode_aggr = 3;
#[doc = "TYPEDEF is an alias for another type. It always has a single field."]
pub const m0_xcode_aggr_M0_XA_TYPEDEF: m0_xcode_aggr = 4;
#[doc = "OPAQUE represents a pointer."]
#[doc = ""]
#[doc = "A field of OPAQUE type must have m0_xcode_field::xf_opaque() function"]
#[doc = "pointer set to a function which determines the actual type of the"]
#[doc = "object pointed to."]
pub const m0_xcode_aggr_M0_XA_OPAQUE: m0_xcode_aggr = 5;
#[doc = "ATOM represents \"atomic\" data-types having no internal"]
#[doc = "structure. m0_xcode_type-s with m0_xcode_type::xct_aggr set to"]
#[doc = "M0_XA_ATOM have m0_xcode_type::xct_nr == 0 and no fields."]
#[doc = ""]
#[doc = "Atomic types are enumerated in m0_xode_atom_type."]
pub const m0_xcode_aggr_M0_XA_ATOM: m0_xcode_aggr = 6;
#[doc = "ATOM represents \"atomic\" data-types having no internal"]
#[doc = "structure. m0_xcode_type-s with m0_xcode_type::xct_aggr set to"]
#[doc = "M0_XA_ATOM have m0_xcode_type::xct_nr == 0 and no fields."]
#[doc = ""]
#[doc = "Atomic types are enumerated in m0_xode_atom_type."]
pub const m0_xcode_aggr_M0_XA_NR: m0_xcode_aggr = 7;
#[doc = "Type of aggregation for a data-type."]
#[doc = ""]
#[doc = "A value of this enum, stored in m0_code_type::xct_aggr determines how fields"]
#[doc = "of the type are interpreted."]
pub type m0_xcode_aggr = ::std::os::raw::c_uint;
extern "C" {
    #[doc = "Human-readable names of m0_xcode_aggr values."]
    pub static mut m0_xcode_aggr_name: [*const ::std::os::raw::c_char; 7usize];
}
pub const m0_xode_atom_type_M0_XAT_VOID: m0_xode_atom_type = 0;
pub const m0_xode_atom_type_M0_XAT_U8: m0_xode_atom_type = 1;
pub const m0_xode_atom_type_M0_XAT_U32: m0_xode_atom_type = 2;
pub const m0_xode_atom_type_M0_XAT_U64: m0_xode_atom_type = 3;
pub const m0_xode_atom_type_M0_XAT_NR: m0_xode_atom_type = 4;
#[doc = "Atomic types."]
#[doc = ""]
#[doc = "To each value of this enumeration, except for M0_XAT_NR, a separate"]
#[doc = "m0_xcode_type (M0_XT_VOID, M0_XT_U8, &c.)."]
pub type m0_xode_atom_type = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Human-readable names of elements of m0_xcode_atom_type"]
    pub static mut m0_xcode_atom_type_name: [*const ::std::os::raw::c_char; 4usize];
}
pub const M0_XCODE_DECOR_READ: ::std::os::raw::c_uint = 0;
pub const M0_XCODE_DECOR_MAX: ::std::os::raw::c_uint = 10;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
#[doc = " Field of data-type."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_xcode_field {
    #[doc = " Field name."]
    pub xf_name: *const ::std::os::raw::c_char,
    #[doc = " Field type."]
    pub xf_type: *const m0_xcode_type,
    #[doc = " Tag, associated with this field."]
    #[doc = ""]
    #[doc = "Tag is used in the following ways:"]
    #[doc = ""]
    #[doc = "- if first field of a SEQUENCE type has type VOID, its tag is"]
    #[doc = "used as a count of element in the sequence;"]
    #[doc = ""]
    #[doc = "- tag of the only field of ARRAY type is the number of elements"]
    #[doc = "in the array;"]
    #[doc = ""]
    #[doc = "- tag of non-first field of a UNION type is used to determine"]
    #[doc = "when the field is actually present in the object: the field is"]
    #[doc = "present iff its tag equals the discriminator of the union."]
    #[doc = ""]
    #[doc = "The discriminator is the value of the first field of the"]
    #[doc = "union."]
    pub xf_tag: u64,
    #[doc = "Fields with m0_xcode_type::xf_type == &M0_XT_OPAQUE are \"opaque\""]
    #[doc = "fields. An opaque field corresponds to a"]
    #[doc = "pointer. m0_xcode_type::xf_opaque() is called by the xcode to follow"]
    #[doc = "the pointer. This function returns (in its \"out\" parameter) a type of"]
    #[doc = "the object pointed to. \"par\" parameter refers to the parent object to"]
    #[doc = "which the field belongs."]
    pub xf_opaque: ::std::option::Option<
        unsafe extern "C" fn(
            par: *const m0_xcode_obj,
            out: *mut *const m0_xcode_type,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "Byte offset of this field from the beginning of the object."]
    pub xf_offset: u32,
    #[doc = "\"Decorations\" are used by xcode users to associate additional"]
    #[doc = "information with introspection elements."]
    #[doc = ""]
    #[doc = "@see m0_xcode_decor_register()"]
    #[doc = "@see m0_xcode_type::xct_decor[]"]
    pub xf_decor: [*mut ::std::os::raw::c_void; 10usize],
    pub xf_read: ::std::option::Option<
        unsafe extern "C" fn(
            it: *const m0_xcode_cursor,
            obj: *mut m0_xcode_obj,
            str_: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_m0_xcode_field() {
    assert_eq!(
        ::std::mem::size_of::<m0_xcode_field>(),
        128usize,
        concat!("Size of: ", stringify!(m0_xcode_field))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_xcode_field>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_xcode_field))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_field>())).xf_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_field),
            "::",
            stringify!(xf_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_field>())).xf_type as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_field),
            "::",
            stringify!(xf_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_field>())).xf_tag as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_field),
            "::",
            stringify!(xf_tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_field>())).xf_opaque as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_field),
            "::",
            stringify!(xf_opaque)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_field>())).xf_offset as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_field),
            "::",
            stringify!(xf_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_field>())).xf_decor as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_field),
            "::",
            stringify!(xf_decor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_field>())).xf_read as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_field),
            "::",
            stringify!(xf_read)
        )
    );
}
#[doc = " Type belongs to BE xcode domain, @see M0_XCA_DOMAIN"]
pub const m0_xcode_type_flags_M0_XCODE_TYPE_FLAG_DOM_BE: m0_xcode_type_flags = 1;
#[doc = " Type belongs to RPC xcode domain, @see M0_XCA_DOMAIN"]
pub const m0_xcode_type_flags_M0_XCODE_TYPE_FLAG_DOM_RPC: m0_xcode_type_flags = 2;
#[doc = " Type belongs to CONF xcode domain, @see M0_XCA_DOMAIN"]
pub const m0_xcode_type_flags_M0_XCODE_TYPE_FLAG_DOM_CONF: m0_xcode_type_flags = 4;
pub type m0_xcode_type_flags = ::std::os::raw::c_uint;
#[doc = "This struct represents a data-type."]
#[repr(C)]
#[derive(Debug)]
pub struct m0_xcode_type {
    #[doc = " What sub-objects instances of this type have and how they are"]
    #[doc = "organized?"]
    pub xct_aggr: m0_xcode_aggr,
    #[doc = " Type name."]
    pub xct_name: *const ::std::os::raw::c_char,
    #[doc = " Custom operations."]
    pub xct_ops: *const m0_xcode_type_ops,
    #[doc = "Which atomic type this is?"]
    #[doc = ""]
    #[doc = "This field is valid only when xt->xct_aggr == M0_XA_ATOM."]
    pub xct_atype: m0_xode_atom_type,
    #[doc = "Flags, associated with this type (if any)."]
    #[doc = "For possible values @see m0_xcode_type_flags enum."]
    pub xct_flags: u32,
    #[doc = "\"Decorations\" are used by xcode users to associate additional"]
    #[doc = "information with introspection elements."]
    #[doc = ""]
    #[doc = "@see m0_xcode_decor_register()"]
    #[doc = "@see m0_xcode_field::xf_decor[]"]
    pub xct_decor: [*mut ::std::os::raw::c_void; 10usize],
    #[doc = " Size in bytes of in-memory instances of this type."]
    pub xct_sizeof: size_t,
    #[doc = " Number of fields."]
    pub xct_nr: size_t,
    #[doc = " Array of fields."]
    pub xct_child: __IncompleteArrayField<m0_xcode_field>,
}
#[test]
fn bindgen_test_layout_m0_xcode_type() {
    assert_eq!(
        ::std::mem::size_of::<m0_xcode_type>(),
        128usize,
        concat!("Size of: ", stringify!(m0_xcode_type))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_xcode_type>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_xcode_type))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_type>())).xct_aggr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_type),
            "::",
            stringify!(xct_aggr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_type>())).xct_name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_type),
            "::",
            stringify!(xct_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_type>())).xct_ops as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_type),
            "::",
            stringify!(xct_ops)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_type>())).xct_atype as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_type),
            "::",
            stringify!(xct_atype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_type>())).xct_flags as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_type),
            "::",
            stringify!(xct_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_type>())).xct_decor as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_type),
            "::",
            stringify!(xct_decor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_type>())).xct_sizeof as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_type),
            "::",
            stringify!(xct_sizeof)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_type>())).xct_nr as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_type),
            "::",
            stringify!(xct_nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_type>())).xct_child as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_type),
            "::",
            stringify!(xct_child)
        )
    );
}
#[doc = " \"Typed\" xcode object."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_xcode_obj {
    #[doc = " Object's type."]
    pub xo_type: *const m0_xcode_type,
    #[doc = " Pointer to object in memory."]
    pub xo_ptr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_m0_xcode_obj() {
    assert_eq!(
        ::std::mem::size_of::<m0_xcode_obj>(),
        16usize,
        concat!("Size of: ", stringify!(m0_xcode_obj))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_xcode_obj>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_xcode_obj))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_obj>())).xo_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_obj),
            "::",
            stringify!(xo_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_obj>())).xo_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_obj),
            "::",
            stringify!(xo_ptr)
        )
    );
}
#[doc = "Custom xcoding functions."]
#[doc = ""]
#[doc = "User provides these functions (which are all optional) to use non-standard"]
#[doc = "xcoding."]
#[doc = ""]
#[doc = "@see m0_xcode_decode()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_xcode_type_ops {
    pub xto_length: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut m0_xcode_ctx,
            obj: *const ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub xto_encode: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut m0_xcode_ctx,
            obj: *const ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub xto_decode: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut m0_xcode_ctx,
            obj: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Call-back invoked by m0_xcode_read() to read custom object"]
    #[doc = " representation."]
    #[doc = ""]
    #[doc = " Returns number of bytes consumed from the string, or negative error"]
    #[doc = " code. obj->xo_ptr of suitable size is allocated by m0_xcode_read(),"]
    #[doc = " obj->xo_type is assigned. The call-back should fill obj->xo_ptr"]
    #[doc = " fields."]
    #[doc = ""]
    #[doc = " @see string_literal()."]
    pub xto_read: ::std::option::Option<
        unsafe extern "C" fn(
            it: *const m0_xcode_cursor,
            obj: *mut m0_xcode_obj,
            str_: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_m0_xcode_type_ops() {
    assert_eq!(
        ::std::mem::size_of::<m0_xcode_type_ops>(),
        32usize,
        concat!("Size of: ", stringify!(m0_xcode_type_ops))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_xcode_type_ops>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_xcode_type_ops))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_type_ops>())).xto_length as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_type_ops),
            "::",
            stringify!(xto_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_type_ops>())).xto_encode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_type_ops),
            "::",
            stringify!(xto_encode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_type_ops>())).xto_decode as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_type_ops),
            "::",
            stringify!(xto_decode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_type_ops>())).xto_read as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_type_ops),
            "::",
            stringify!(xto_read)
        )
    );
}
pub const M0_XCODE_DEPTH_MAX: ::std::os::raw::c_uint = 10;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
#[doc = " This value is never returned by m0_xcode_next(). It is set by the"]
#[doc = "user to indicate the beginning of iteration."]
pub const m0_xcode_cursor_flag_M0_XCODE_CURSOR_NONE: m0_xcode_cursor_flag = 0;
#[doc = " Tree element is visited for the first time."]
pub const m0_xcode_cursor_flag_M0_XCODE_CURSOR_PRE: m0_xcode_cursor_flag = 1;
#[doc = " The sub-tree, rooted at an element's field has been processed"]
#[doc = "fully."]
pub const m0_xcode_cursor_flag_M0_XCODE_CURSOR_IN: m0_xcode_cursor_flag = 2;
#[doc = " All fields have been processed fully, this is the last time the"]
#[doc = "element is visited."]
pub const m0_xcode_cursor_flag_M0_XCODE_CURSOR_POST: m0_xcode_cursor_flag = 3;
#[doc = " All fields have been processed fully, this is the last time the"]
#[doc = "element is visited."]
pub const m0_xcode_cursor_flag_M0_XCODE_CURSOR_NR: m0_xcode_cursor_flag = 4;
#[doc = "Traversal order."]
pub type m0_xcode_cursor_flag = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Human-readable names of values in m0_xcode_cursor_flag"]
    pub static mut m0_xcode_cursor_flag_name: [*const ::std::os::raw::c_char; 4usize];
}
#[doc = "Cursor that captures the state of iteration."]
#[doc = ""]
#[doc = "The cursor contains a stack of \"frames\". A frame describes the iteration at"]
#[doc = "a particular level."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_xcode_cursor {
    #[doc = " Depth of the iteration."]
    pub xcu_depth: ::std::os::raw::c_int,
    pub xcu_stack: [m0_xcode_cursor_m0_xcode_cursor_frame; 10usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_xcode_cursor_m0_xcode_cursor_frame {
    #[doc = " An object that the iteration is currently in."]
    pub s_obj: m0_xcode_obj,
    #[doc = " A field within the object that the iteration is currently"]
    #[doc = "at."]
    pub s_fieldno: ::std::os::raw::c_int,
    #[doc = " A sequence element within the field that the iteration is"]
    #[doc = "currently at."]
    #[doc = ""]
    #[doc = "This is valid iff ->s_obj->xo_type->xcf_aggr =="]
    #[doc = "M0_XA_SEQUENCE."]
    pub s_elno: u64,
    #[doc = " Flag, indicating visiting order."]
    pub s_flag: m0_xcode_cursor_flag,
    #[doc = " Datum reserved for cursor users."]
    pub s_datum: u64,
}
#[test]
fn bindgen_test_layout_m0_xcode_cursor_m0_xcode_cursor_frame() {
    assert_eq!(
        ::std::mem::size_of::<m0_xcode_cursor_m0_xcode_cursor_frame>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(m0_xcode_cursor_m0_xcode_cursor_frame)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<m0_xcode_cursor_m0_xcode_cursor_frame>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(m0_xcode_cursor_m0_xcode_cursor_frame)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<m0_xcode_cursor_m0_xcode_cursor_frame>())).s_obj as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_cursor_m0_xcode_cursor_frame),
            "::",
            stringify!(s_obj)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<m0_xcode_cursor_m0_xcode_cursor_frame>())).s_fieldno as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_cursor_m0_xcode_cursor_frame),
            "::",
            stringify!(s_fieldno)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<m0_xcode_cursor_m0_xcode_cursor_frame>())).s_elno as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_cursor_m0_xcode_cursor_frame),
            "::",
            stringify!(s_elno)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<m0_xcode_cursor_m0_xcode_cursor_frame>())).s_flag as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_cursor_m0_xcode_cursor_frame),
            "::",
            stringify!(s_flag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<m0_xcode_cursor_m0_xcode_cursor_frame>())).s_datum as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_cursor_m0_xcode_cursor_frame),
            "::",
            stringify!(s_datum)
        )
    );
}
#[test]
fn bindgen_test_layout_m0_xcode_cursor() {
    assert_eq!(
        ::std::mem::size_of::<m0_xcode_cursor>(),
        488usize,
        concat!("Size of: ", stringify!(m0_xcode_cursor))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_xcode_cursor>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_xcode_cursor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_cursor>())).xcu_depth as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_cursor),
            "::",
            stringify!(xcu_depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_cursor>())).xcu_stack as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_cursor),
            "::",
            stringify!(xcu_stack)
        )
    );
}
extern "C" {
    pub fn m0_xcode_cursor_init(it: *mut m0_xcode_cursor, obj: *const m0_xcode_obj);
}
extern "C" {
    #[doc = "Iterates over tree of xcode types."]
    #[doc = ""]
    #[doc = "To start the iteration, call this with the cursor where"]
    #[doc = "m0_xcode_cursor_frame::s_obj field of the 0th stack frame is set to the"]
    #[doc = "desired object and the rest of the cursor is zeroed (see"]
    #[doc = "m0_xcode_ctx_init())."]
    #[doc = ""]
    #[doc = "m0_xcode_next() returns a positive value when iteration can be continued, 0"]
    #[doc = "when the iteration is complete and negative error code on error. The intended"]
    #[doc = "usage pattern is"]
    #[doc = ""]
    #[doc = "@code"]
    #[doc = "while ((result = m0_xcode_next(it)) > 0) {"]
    #[doc = "... process next tree node ..."]
    #[doc = "}"]
    #[doc = "@endcode"]
    #[doc = ""]
    #[doc = "On each return, m0_xcode_next() sets the cursor to point to the next element"]
    #[doc = "reached in iteration. The information about the element is stored in the"]
    #[doc = "topmost element of the cursor's stack and can be extracted with"]
    #[doc = "m0_xcode_cursor_top()."]
    #[doc = ""]
    #[doc = "An element with N children is reached 1 + N + 1 times: once in preorder, once"]
    #[doc = "in inorder after each child is processed and once in postorder. Here N equals"]
    #[doc = ""]
    #[doc = "- number of fields in a RECORD object;"]
    #[doc = ""]
    #[doc = "- 1 or 2 in a UNION object: one for discriminator and one for an actually"]
    #[doc = "present field, if any;"]
    #[doc = ""]
    #[doc = "- 1 + (number of elements in array) in a SEQUENCE object. Additional 1 is"]
    #[doc = "for count field;"]
    #[doc = ""]
    #[doc = "- number of elements in array in an ARRAY object;"]
    #[doc = ""]
    #[doc = "- 0 for an ATOMIC object."]
    #[doc = ""]
    #[doc = "For example, to traverse the tree in preorder, one does something like"]
    #[doc = ""]
    #[doc = "@code"]
    #[doc = "while ((result = m0_xcode_next(it)) > 0) {"]
    #[doc = "if (m0_xcode_cursor_top(it)->s_flag == M0_XCODE_CURSOR_PRE) {"]
    #[doc = "... process the element ..."]
    #[doc = "}"]
    #[doc = "}"]
    #[doc = "@endcode"]
    pub fn m0_xcode_next(it: *mut m0_xcode_cursor) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Abandons the iteration at the current level and returns one level up."]
    pub fn m0_xcode_skip(it: *mut m0_xcode_cursor);
}
extern "C" {
    #[doc = " Returns the topmost frame in the cursor's stack."]
    pub fn m0_xcode_cursor_top(
        it: *mut m0_xcode_cursor,
    ) -> *mut m0_xcode_cursor_m0_xcode_cursor_frame;
}
extern "C" {
    #[doc = " Returns the field currently being processed."]
    pub fn m0_xcode_cursor_field(it: *const m0_xcode_cursor) -> *const m0_xcode_field;
}
#[doc = " Little-endian."]
pub const m0_xcode_endianness_M0_XEND_LE: m0_xcode_endianness = 0;
#[doc = " Big-endian."]
pub const m0_xcode_endianness_M0_XEND_BE: m0_xcode_endianness = 1;
#[doc = " Big-endian."]
pub const m0_xcode_endianness_M0_XEND_NR: m0_xcode_endianness = 2;
#[doc = " Endianness (http://en.wikipedia.org/wiki/Endianness)"]
pub type m0_xcode_endianness = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Human-readable names of values in m0_xcode_endianness"]
    pub static mut m0_xcode_endianness_name: [*const ::std::os::raw::c_char; 2usize];
}
#[doc = " xcoding context."]
#[doc = ""]
#[doc = "The context contains information about attributes of xcoding operation and"]
#[doc = "its progress."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_xcode_ctx {
    #[doc = " Endianness of serialized representation."]
    pub xcx_end: m0_xcode_endianness,
    #[doc = "Current point in the buffer vector."]
    #[doc = ""]
    #[doc = "The cursor points to the where encoding will write the next byte and"]
    #[doc = "from where decoding will read the next byte."]
    #[doc = ""]
    #[doc = "It should be initialised with m0_bufvec_cursor_init() prior to"]
    #[doc = "m0_xcode_encode() or m0_xcode_decode() call. The size of the cursors"]
    #[doc = "buffer should be not less than the size of serialised structure"]
    #[doc = "representation."]
    pub xcx_buf: m0_bufvec_cursor,
    #[doc = "State of the iteration through object tree."]
    pub xcx_it: m0_xcode_cursor,
    #[doc = "Allocation function used by decoding to allocate the topmost object"]
    #[doc = "and all its non-inline sub-objects (arrays and opaque sub-objects)."]
    pub xcx_alloc: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut m0_xcode_cursor,
            arg2: size_t,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub xcx_free: ::std::option::Option<unsafe extern "C" fn(ctx: *mut m0_xcode_cursor)>,
    #[doc = "This function is called every time type is traversed with"]
    #[doc = "m0_xcode_next()."]
    pub xcx_iter: ::std::option::Option<
        unsafe extern "C" fn(it: *const m0_xcode_cursor) -> ::std::os::raw::c_int,
    >,
    #[doc = "This function is called when xcode.c:ctx_walk() function called from"]
    #[doc = "m0_xcode_encode(), m0_xcode_decode(), m0_xcode_length() ends"]
    #[doc = "processing of given xcode context and xcode object embeded into it."]
    pub xcx_iter_end: ::std::option::Option<unsafe extern "C" fn(it: *const m0_xcode_cursor)>,
}
#[test]
fn bindgen_test_layout_m0_xcode_ctx() {
    assert_eq!(
        ::std::mem::size_of::<m0_xcode_ctx>(),
        552usize,
        concat!("Size of: ", stringify!(m0_xcode_ctx))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_xcode_ctx>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_xcode_ctx))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_ctx>())).xcx_end as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_ctx),
            "::",
            stringify!(xcx_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_ctx>())).xcx_buf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_ctx),
            "::",
            stringify!(xcx_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_ctx>())).xcx_it as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_ctx),
            "::",
            stringify!(xcx_it)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_ctx>())).xcx_alloc as *const _ as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_ctx),
            "::",
            stringify!(xcx_alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_ctx>())).xcx_free as *const _ as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_ctx),
            "::",
            stringify!(xcx_free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_ctx>())).xcx_iter as *const _ as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_ctx),
            "::",
            stringify!(xcx_iter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_xcode_ctx>())).xcx_iter_end as *const _ as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_xcode_ctx),
            "::",
            stringify!(xcx_iter_end)
        )
    );
}
extern "C" {
    #[doc = "Sets up the context to start xcoding of a given object."]
    pub fn m0_xcode_ctx_init(ctx: *mut m0_xcode_ctx, obj: *const m0_xcode_obj);
}
extern "C" {
    #[doc = "@see m0_xcode_ctx::xcx_buf"]
    pub fn m0_xcode_decode(ctx: *mut m0_xcode_ctx) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "@see m0_xcode_ctx::xcx_buf"]
    pub fn m0_xcode_encode(ctx: *mut m0_xcode_ctx) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Calculates the length of serialized representation."]
    pub fn m0_xcode_length(ctx: *mut m0_xcode_ctx) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Iterates (recurses) over fields of the given type and their types."]
    #[doc = ""]
    #[doc = " \"t\" is invoked for each type embedded in \"xt\" (including \"xt\" itself)."]
    #[doc = ""]
    #[doc = " \"f\" is invoked for each field embedded in \"xt\"."]
    pub fn m0_xcode_type_iterate(
        xt: *mut m0_xcode_type,
        t: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut m0_xcode_type, arg2: *mut ::std::os::raw::c_void),
        >,
        f: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut m0_xcode_type,
                arg2: *mut m0_xcode_field,
                arg3: *mut ::std::os::raw::c_void,
            ),
        >,
        datum: *mut ::std::os::raw::c_void,
    );
}
pub const m0_xcode_what_M0_XCODE_ENCODE: m0_xcode_what = 0;
pub const m0_xcode_what_M0_XCODE_DECODE: m0_xcode_what = 1;
pub type m0_xcode_what = ::std::os::raw::c_uint;
extern "C" {
    #[doc = "Initializes xcode context and encodes or decodes the xcode"]
    #[doc = "object in the cursor based on @what value."]
    pub fn m0_xcode_encdec(
        obj: *mut m0_xcode_obj,
        cur: *mut m0_bufvec_cursor,
        what: m0_xcode_what,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Allocates buffer and places there encoded object."]
    pub fn m0_xcode_obj_enc_to_buf(
        obj: *mut m0_xcode_obj,
        buf: *mut *mut ::std::os::raw::c_void,
        len: *mut m0_bcount_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Takes buffer with encoded object and builds original object."]
    pub fn m0_xcode_obj_dec_from_buf(
        obj: *mut m0_xcode_obj,
        buf: *mut ::std::os::raw::c_void,
        len: m0_bcount_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Initializes xcode context and returns the length of xcode object."]
    pub fn m0_xcode_data_size(
        ctx: *mut m0_xcode_ctx,
        obj: *const m0_xcode_obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m0_xcode_alloc(it: *mut m0_xcode_cursor, nob: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "True iff \"xt\" is an array of bytes."]
    pub fn m0_xcode_is_byte_array(xt: *const m0_xcode_type) -> bool;
}
extern "C" {
    #[doc = "Handles memory allocation during decoding."]
    #[doc = ""]
    #[doc = "This function takes an xcode iteration cursor and, if necessary, allocates"]
    #[doc = "memory where the object currently being decoded will reside."]
    #[doc = ""]
    #[doc = "The pointer to the allocated memory is returned in m0_xcode_obj::xo_ptr. In"]
    #[doc = "addition, this pointer is stored at the appropriate offset in the parent"]
    #[doc = "object."]
    pub fn m0_xcode_alloc_obj(
        it: *mut m0_xcode_cursor,
        alloc: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut m0_xcode_cursor,
                arg2: size_t,
            ) -> *mut ::std::os::raw::c_void,
        >,
    ) -> ssize_t;
}
extern "C" {
    #[doc = " Reads an object from a human-readable string representation."]
    #[doc = ""]
    #[doc = " String has the following EBNF grammar:"]
    #[doc = ""]
    #[doc = "     S           ::= RECORD | UNION | SEQUENCE | ARRAY | ATOM | CUSTOM"]
    #[doc = "     RECORD      ::= '(' [S-LIST] ')'"]
    #[doc = "     S-LIST      ::= S | S-LIST ',' S"]
    #[doc = "     UNION       ::= '{' TAG '|' [S] '}'"]
    #[doc = "     SEQUENCE    ::= STRING | COUNTED"]
    #[doc = "     ARRAY       ::= '<' [S-LIST] '>'"]
    #[doc = "     STRING      ::= '\"' CHAR* '\"'"]
    #[doc = "     COUNTED     ::= '[' COUNT ':' [S-LIST] ']'"]
    #[doc = "     ATOM        ::= EMPTY | NUMBER"]
    #[doc = "     TAG         ::= ATOM"]
    #[doc = "     COUNT       ::= ATOM"]
    #[doc = "     CUSTOM      ::= '^' CHAR* | '@' CHAR*"]
    #[doc = ""]
    #[doc = " Where CHAR is any non-NUL character, NUMBER is anything recognizable by"]
    #[doc = " sscanf(3) as a number and EMPTY is the empty string. Blank-spaces (\\n, \\t,"]
    #[doc = " \\v, \\r, space and comments) between tokens are ignored. Comments start with a"]
    #[doc = " hash symbol and run to the end of line."]
    #[doc = ""]
    #[doc = " Custom type representations start with a caret (^) and are recognised by"]
    #[doc = " m0_xcode_type_ops::xto_read() call-backs."]
    #[doc = ""]
    #[doc = " Custom field representations start with with '@' and are recognised by a"]
    #[doc = " call-back stored in m0_xcode_field::xf_read()"]
    #[doc = ""]
    #[doc = " Examples:"]
    #[doc = " @verbatim"]
    #[doc = " (0, 1)"]
    #[doc = " (0, (1, 2))"]
    #[doc = " ()"]
    #[doc = " {1| (1, 2)}"]
    #[doc = " {2| 6}"]
    #[doc = " {3|}               # a union with invalid discriminant or with a void value"]
    #[doc = " [0]                # 0 sized array"]
    #[doc = " [3: 6, 5, 4]"]
    #[doc = " [: 1, 2, 3]        # fixed size sequence"]
    #[doc = " <7, 12, 0>         # fixed size array"]
    #[doc = " \"incomprehensible\" # a byte (U8) sequence with 16 elements"]
    #[doc = " 10                 # number 10"]
    #[doc = " 0xa                # number 10"]
    #[doc = " 012                # number 10"]
    #[doc = " (0, \"katavothron\", {42| [3: (\"x\"), (\"y\"), (\"z\")]}, \"paradiorthosis\")"]
    #[doc = " @endverbatim"]
    #[doc = ""]
    #[doc = " Typedefs and opaque types require no special syntax."]
    #[doc = ""]
    #[doc = " @retval 0 success"]
    #[doc = " @retval -EPROTO syntax error"]
    #[doc = " @retval -EINVAL invalid data in string after end of representation"]
    #[doc = " @retval -ve other error (-ENOMEM, &c.)"]
    #[doc = ""]
    #[doc = " Error or not, the caller should free the (partially) constructed object with"]
    #[doc = " m0_xcode_free()."]
    pub fn m0_xcode_read(
        obj: *mut m0_xcode_obj,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Prints an xcode object to a string."]
    #[doc = ""]
    #[doc = " This function is (almost) the inverse of m0_xcode_read()."]
    #[doc = ""]
    #[doc = " @note No attempt at pretty-printing is done. All atomic values are output in"]
    #[doc = " hexadecimal, etc. Its main intended use is logging and debugging. Byte arrays"]
    #[doc = " that contain only printable ASCII values are printed in the \"string literal\""]
    #[doc = " format."]
    pub fn m0_xcode_print(
        obj: *const m0_xcode_obj,
        str_: *mut ::std::os::raw::c_char,
        nr: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m0_xcode_free_obj(obj: *mut m0_xcode_obj);
}
extern "C" {
    pub fn m0_xcode_free(ctx: *mut m0_xcode_ctx);
}
extern "C" {
    pub fn m0_xcode_cmp(o0: *const m0_xcode_obj, o1: *const m0_xcode_obj) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m0_xcode_dup(dest: *mut m0_xcode_ctx, src: *mut m0_xcode_ctx) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Returns true iff the type has all \"on\" and none of \"off\" bits in"]
    #[doc = " m0_xcode_type::xct_flags and the same holds recursively for types of all its"]
    #[doc = " fields."]
    #[doc = " Doesn't check xcode types with aggregation type specified by aggr_umask."]
    pub fn m0_xcode_type_flags(xt: *mut m0_xcode_type, on: u32, off: u32, aggr_umask: u64) -> bool;
}
extern "C" {
    #[doc = "Returns the address of a sub-object within an object."]
    #[doc = ""]
    #[doc = "@param obj     - typed object"]
    #[doc = "@param fieldno - ordinal number of field"]
    #[doc = "@param elno    - for a SEQUENCE or ARRAY field, index of the element to"]
    #[doc = "return the address of."]
    #[doc = ""]
    #[doc = "The behaviour of this function for SEQUENCE objects depends on \"elno\""]
    #[doc = "value. SEQUENCE objects have the following structure:"]
    #[doc = ""]
    #[doc = "@code"]
    #[doc = "struct x_seq {"]
    #[doc = "scalar_t  xs_nr;"]
    #[doc = "struct y *xs_body;"]
    #[doc = "};"]
    #[doc = "@endcode"]
    #[doc = ""]
    #[doc = "where xs_nr stores a number of elements in the sequence and xs_body points to"]
    #[doc = "an array of the elements."]
    #[doc = ""]
    #[doc = "With fieldno == 1, m0_xcode_addr() returns"]
    #[doc = ""]
    #[doc = "- &xseq->xs_body when (elno == ~0ULL) and"]
    #[doc = ""]
    #[doc = "- &xseq->xs_body[elno] otherwise."]
    pub fn m0_xcode_addr(
        obj: *const m0_xcode_obj,
        fieldno: ::std::os::raw::c_int,
        elno: u64,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Returns the value of the given atomic field."]
    pub fn m0_xcode_atom(obj: *const m0_xcode_obj) -> u64;
}
extern "C" {
    #[doc = "Constructs a m0_xcode_obj instance representing a sub-object of a given"]
    #[doc = "object."]
    #[doc = ""]
    #[doc = "Address of sub-object (subobj->xo_ptr) is obtained by calling"]
    #[doc = "m0_xcode_addr()."]
    #[doc = ""]
    #[doc = "Type of sub-object (subobj->xo_type) is usually the type stored in the parent"]
    #[doc = "object's field (m0_xcode_field::xf_type), but for opaque fields it is"]
    #[doc = "obtained by calling m0_xcode_field::xf_opaque()."]
    pub fn m0_xcode_subobj(
        subobj: *mut m0_xcode_obj,
        obj: *const m0_xcode_obj,
        fieldno: ::std::os::raw::c_int,
        elno: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Returns the value of first field in a given object, assuming this field is"]
    #[doc = "atomic."]
    #[doc = ""]
    #[doc = "This function is suitable to return discriminator of a UNION object or"]
    #[doc = "element count of a SEQUENCE object."]
    #[doc = ""]
    #[doc = "@note when the first field has M0_XT_VOID type, the tag"]
    #[doc = "(m0_xcode_field::xf_tag) of this field is returned."]
    pub fn m0_xcode_tag(obj: *const m0_xcode_obj) -> u64;
}
extern "C" {
    #[doc = " Finds and returns (in *place) first (in m0_xcode_next() order) field of type"]
    #[doc = " xt in the given object."]
    #[doc = ""]
    #[doc = " Returns -ENOENT if no field is found."]
    pub fn m0_xcode_find(
        obj: *mut m0_xcode_obj,
        xt: *const m0_xcode_type,
        place: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m0_xcode_type_invariant(xt: *const m0_xcode_type) -> bool;
}
extern "C" {
    #[doc = " Starts construction of a \"dynamic union\"."]
    #[doc = ""]
    #[doc = " With the help of m0_xcode_union_init(), m0_xcode_union_add() and"]
    #[doc = " m0_xcode_union_close() a discriminated union type (M0_XA_UNION) can be"]
    #[doc = " constructed at run-time. A use case is a situation where branches of the"]
    #[doc = " union are defined in separate modules. With dynamic union, new branches can"]
    #[doc = " be added without modifying central code."]
    #[doc = ""]
    #[doc = " After a call to m0_xcode_union_init(), new branches are added with"]
    #[doc = " m0_xcode_union_add(). When all branches are added, m0_xcode_union_close()"]
    #[doc = " completes the construction of union xcode type. The result can be used as a"]
    #[doc = " usual xcode type."]
    #[doc = ""]
    #[doc = " The implementation is deliberately simplistic to avoid issues with sizeof and"]
    #[doc = " alignment calculations. Union discriminator is always M0_XT_U64."]
    #[doc = ""]
    #[doc = " @param un - xcode type to be initialised. The user has to allocate this"]
    #[doc = "             together with at least @maxbranches m0_xcode_field instances. See"]
    #[doc = "             conf/db.c:conx_obj for example."]
    #[doc = ""]
    #[doc = " @praam name - xcode type name, assigned to un->xct_name"]
    #[doc = " @param discriminator - the name of the first field"]
    #[doc = " @param maxbranch - maximal number of branches that can be added"]
    #[doc = ""]
    #[doc = " @see m0_xcode_union_add(), m0_xcode_union_close()"]
    pub fn m0_xcode_union_init(
        un: *mut m0_xcode_type,
        name: *const ::std::os::raw::c_char,
        discriminator: *const ::std::os::raw::c_char,
        maxbranches: size_t,
    );
}
extern "C" {
    #[doc = " Finalises a \"dynamic union\"."]
    #[doc = ""]
    #[doc = " @see m0_xcode_union_init(), m0_xcode_union_close()"]
    pub fn m0_xcode_union_fini(un: *mut m0_xcode_type);
}
extern "C" {
    #[doc = " Adds another branch to the dynamic union."]
    #[doc = ""]
    #[doc = " @see m0_xcode_union_init(), m0_xcode_union_close()"]
    pub fn m0_xcode_union_add(
        un: *mut m0_xcode_type,
        name: *const ::std::os::raw::c_char,
        xt: *const m0_xcode_type,
        tag: u64,
    );
}
extern "C" {
    #[doc = " Completes construction of dynamic union, calculates sizeof."]
    #[doc = ""]
    #[doc = " @see m0_xcode_union_init(), m0_xcode_union_add()"]
    pub fn m0_xcode_union_close(un: *mut m0_xcode_type);
}
extern "C" {
    pub static M0_XT_VOID: m0_xcode_type;
}
extern "C" {
    pub static M0_XT_U8: m0_xcode_type;
}
extern "C" {
    pub static M0_XT_U32: m0_xcode_type;
}
extern "C" {
    pub static M0_XT_U64: m0_xcode_type;
}
extern "C" {
    pub static M0_XT_OPAQUE: m0_xcode_type;
}
#[doc = "Void type used by ff2c in places where C syntax requires a type name."]
pub type m0_void_t = [::std::os::raw::c_char; 0usize];
extern "C" {
    #[doc = "Returns a previously unused \"decoration number\", which can be used as an"]
    #[doc = "index in m0_xcode_field::xf_decor[] and m0_xcode_type::xct_decor[] arrays."]
    #[doc = ""]
    #[doc = "This number can be used to associate additional state with xcode"]
    #[doc = "introspection elements:"]
    #[doc = ""]
    #[doc = "@code"]
    #[doc = "foo_decor_num = m0_xcode_decor_register();"]
    #[doc = ""]
    #[doc = "..."]
    #[doc = ""]
    #[doc = "struct m0_xcode_type  *xt;"]
    #[doc = "struct m0_xcode_field *f;"]
    #[doc = ""]
    #[doc = "xt->xct_decor[foo_decor_num] = m0_alloc(sizeof(struct foo_type_decor));"]
    #[doc = "f->xf_decor[foo_decor_num] = m0_alloc(sizeof(struct foo_field_decor));"]
    #[doc = "@endcode"]
    pub fn m0_xcode_decor_register() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Partially initializes a branded object type from a xcode type descriptor."]
    #[doc = ""]
    #[doc = " @see bob.h"]
    pub fn m0_xcode_bob_type_init(
        bt: *mut m0_bob_type,
        xt: *const m0_xcode_type,
        magix_field: size_t,
        magix: u64,
    );
}
extern "C" {
    pub fn m0_xcode_ctx_top(ctx: *const m0_xcode_ctx) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn m0_xc_u8_init();
}
extern "C" {
    pub fn m0_xc_u16_init();
}
extern "C" {
    pub fn m0_xc_u32_init();
}
extern "C" {
    pub fn m0_xc_u64_init();
}
extern "C" {
    pub fn m0_xc_void_init();
}
extern "C" {
    pub fn m0_xc_opaque_init();
}
extern "C" {
    pub static mut m0_list_xc: *mut m0_xcode_type;
}
extern "C" {
    pub static mut m0_list_link_xc: *mut m0_xcode_type;
}
extern "C" {
    pub fn m0_xc_m0_list_struct_init();
}
extern "C" {
    pub fn m0_xc_m0_list_link_struct_init();
}
extern "C" {
    pub fn m0_xc_lib_list_init();
}
extern "C" {
    pub fn m0_xc_lib_list_fini();
}
#[doc = "@defgroup tlist Typed lists."]
#[doc = ""]
#[doc = "Typed list module provides a double-linked list implementation that"]
#[doc = "eliminates some chores and sources of errors typical for the \"raw\" m0_list"]
#[doc = "interface."]
#[doc = ""]
#[doc = "Typed list is implemented on top of m0_list and adds the following features:"]
#[doc = ""]
#[doc = "- a \"list descriptor\" (m0_tl_descr) object holding information about this"]
#[doc = "list type, including its human readable name;"]
#[doc = ""]
#[doc = "- \"magic\" numbers embedded in list header and list links and checked by"]
#[doc = "the code to catch corruptions;"]
#[doc = ""]
#[doc = "- automatic conversion to and from list links and ambient objects they"]
#[doc = "are embedded to, obviating the need in container_of() and"]
#[doc = "m0_list_entry() calls. In fact, links (m0_tlink) are not mentioned in"]
#[doc = "tlist interface at all;"]
#[doc = ""]
#[doc = "- gdb (7.0) pretty-printer for lists (not yet implemented)."]
#[doc = ""]
#[doc = "tlist is a safe and more convenient alternative to m0_list. As a general"]
#[doc = "rule, m0_list should be used only when performance is critical or some"]
#[doc = "flexibility beyond what tlist provides (e.g., a cyclic list without a head"]
#[doc = "object) is necessary."]
#[doc = ""]
#[doc = "Similarly to m0_list, tlist is a purely algorithmic module: it deals with"]
#[doc = "neither concurrency nor liveness nor with any similar issues that its callers"]
#[doc = "are supposed to handle."]
#[doc = ""]
#[doc = "To describe a typical tlist usage pattern, suppose that one wants a list of"]
#[doc = "objects of type foo hanging off every object of type bar."]
#[doc = ""]
#[doc = "First, two things have to be done:"]
#[doc = ""]
#[doc = "- \"list link\" has to be embedded in foo:"]
#[doc = ""]
#[doc = "@code"]
#[doc = "struct foo {"]
#[doc = "..."]
#[doc = "struct m0_tlink f_linkage;"]
#[doc = "..."]
#[doc = "};"]
#[doc = "@endcode"]
#[doc = ""]
#[doc = "- then, a \"list head\" has to be embedded in bar:"]
#[doc = ""]
#[doc = "@code"]
#[doc = "struct bar {"]
#[doc = "..."]
#[doc = "struct m0_tl b_list;"]
#[doc = "..."]
#[doc = "};"]
#[doc = "@endcode"]
#[doc = ""]
#[doc = "- now, define a tlist type:"]
#[doc = ""]
#[doc = "@code"]
#[doc = "static const struct m0_tl_descr foobar_list = {"]
#[doc = ".td_name        = \"foo-s of bar\","]
#[doc = ".td_link_offset = offsetof(struct foo, f_linkage),"]
#[doc = ".td_head_magic  = 0x666f6f6261726865 // \"foobarhe\""]
#[doc = "};"]
#[doc = "@endcode"]
#[doc = ""]
#[doc = "This defines the simplest form of tlist without magic checking in list links"]
#[doc = "(the magic embedded in a list head is checked anyway). To add magic checking,"]
#[doc = "place a magic field in foo:"]
#[doc = ""]
#[doc = "@code"]
#[doc = "struct foo {"]
#[doc = "..."]
#[doc = "uint64_t f_magic;"]
#[doc = "..."]
#[doc = "};"]
#[doc = ""]
#[doc = "static const struct m0_tl_descr foobar_list = {"]
#[doc = "..."]
#[doc = ".td_link_magic_offset = offsetof(struct foo, f_magic),"]
#[doc = ".td_link_magic        = 0x666f6f6261726c69 // \"foobarli\""]
#[doc = "};"]
#[doc = "@endcode"]
#[doc = ""]
#[doc = "Magic field can be shared by multiple tlist links embedded in the same object"]
#[doc = "and can be used for other sanity checking. An \"outermost\" finaliser function"]
#[doc = "must clear the magic as its last step to catch use-after-fini errors."]
#[doc = ""]
#[doc = "Now, one can populate and manipulate foo-bar lists:"]
#[doc = ""]
#[doc = "@code"]
#[doc = "struct bar  B;"]
#[doc = "struct foo  F;"]
#[doc = "struct foo *scan;"]
#[doc = ""]
#[doc = "m0_tlist_init(&B.b_list);"]
#[doc = "m0_tlink_init(&F.f_linkage);"]
#[doc = ""]
#[doc = "m0_tlist_add(&foobar_list, &B.b_list, &F);"]
#[doc = "M0_ASSERT(m0_tl_contains(&foobar_list, &B.b_list, &F));"]
#[doc = ""]
#[doc = "m0_tlist_for(&foobar_list, &B.b_list, scan)"]
#[doc = "M0_ASSERT(scan == &F);"]
#[doc = "m0_tlist_endfor;"]
#[doc = "@endcode"]
#[doc = ""]
#[doc = "@note Differently from m0_list, tlist heads and links must be initialised"]
#[doc = "before use, even when first usage overwrites the entity completely. This"]
#[doc = "allows stronger checking in tlist manipulation functions."]
#[doc = ""]
#[doc = "<b>Type-safe macros.</b>"]
#[doc = ""]
#[doc = "M0_TL_DESCR_DECLARE(), M0_TL_DECLARE(), M0_TL_DESCR_DEFINE() and"]
#[doc = "M0_TL_DEFINE() macros generate versions of tlist interface tailored for a"]
#[doc = "particular use case."]
#[doc = ""]
#[doc = "4 separate macros are necessary for flexibility. They should be used in"]
#[doc = "exactly one of the following ways for any given typed list:"]
#[doc = ""]
#[doc = "- static tlist, used in a single module only: M0_TL_DEFINE() and"]
#[doc = "M0_TL_DESCR_DEFINE() with scope \"static\" in the module .c file;"]
#[doc = ""]
#[doc = "- tlist exported from a module: M0_TL_DEFINE() and M0_TL_DESCR_DEFINE()"]
#[doc = "with scope \"\" in .c file and M0_TL_DESCR_DECLARE(), M0_TL_DECLARE()"]
#[doc = "with scope \"extern\" in .h file;"]
#[doc = ""]
#[doc = "- tlist exported from a module as a collection of inline functions:"]
#[doc = "M0_TL_DESCR_DEFINE() in .c file and M0_TL_DESCR_DECLARE() with scope"]
#[doc = "\"extern\" followed by M0_TL_DEFINE() with scope \"static inline\" in .h"]
#[doc = "file."]
#[doc = ""]
#[doc = "Use m0_tl_for() and m0_tl_endfor() to iterate over lists generated by"]
#[doc = "M0_TL_DECLARE() and M0_TL_DEFINE()."]
#[doc = ""]
#[doc = "@{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_tl_descr {
    #[doc = " Human-readable list name, used for error messages."]
    pub td_name: *const ::std::os::raw::c_char,
    #[doc = " Offset of list link (m0_tlink) in the ambient object."]
    pub td_link_offset: ::std::os::raw::c_int,
    #[doc = "Offset of magic field in the ambient object."]
    #[doc = "This is used only when link magic checking is on."]
    #[doc = ""]
    #[doc = "@see m0_tl_descr::td_link_magic"]
    pub td_link_magic_offset: ::std::os::raw::c_int,
    #[doc = "Magic stored in an ambient object."]
    #[doc = ""]
    #[doc = "If this field is 0, link magic checking is disabled."]
    pub td_link_magic: u64,
    #[doc = "Magic stored in m0_tl::t_magic and checked on all tlist"]
    #[doc = "operations."]
    pub td_head_magic: u64,
    #[doc = " Size of the ambient object."]
    pub td_container_size: size_t,
}
#[test]
fn bindgen_test_layout_m0_tl_descr() {
    assert_eq!(
        ::std::mem::size_of::<m0_tl_descr>(),
        40usize,
        concat!("Size of: ", stringify!(m0_tl_descr))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_tl_descr>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_tl_descr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_tl_descr>())).td_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_tl_descr),
            "::",
            stringify!(td_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_tl_descr>())).td_link_offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_tl_descr),
            "::",
            stringify!(td_link_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<m0_tl_descr>())).td_link_magic_offset as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_tl_descr),
            "::",
            stringify!(td_link_magic_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_tl_descr>())).td_link_magic as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_tl_descr),
            "::",
            stringify!(td_link_magic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_tl_descr>())).td_head_magic as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_tl_descr),
            "::",
            stringify!(td_head_magic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_tl_descr>())).td_container_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_tl_descr),
            "::",
            stringify!(td_container_size)
        )
    );
}
#[doc = "tlist head."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_tl {
    #[doc = "Head magic. This is set to m0_tl::td_head_magic and verified by the"]
    #[doc = "list invariant."]
    pub t_magic: u64,
    #[doc = " Underlying m0_list."]
    pub t_head: m0_list,
}
#[test]
fn bindgen_test_layout_m0_tl() {
    assert_eq!(
        ::std::mem::size_of::<m0_tl>(),
        24usize,
        concat!("Size of: ", stringify!(m0_tl))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_tl>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_tl))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_tl>())).t_magic as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_tl),
            "::",
            stringify!(t_magic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_tl>())).t_head as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_tl),
            "::",
            stringify!(t_head)
        )
    );
}
#[doc = "tlist link."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_tlink {
    #[doc = " Underlying m0_list link."]
    pub t_link: m0_list_link,
}
#[test]
fn bindgen_test_layout_m0_tlink() {
    assert_eq!(
        ::std::mem::size_of::<m0_tlink>(),
        16usize,
        concat!("Size of: ", stringify!(m0_tlink))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_tlink>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_tlink))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_tlink>())).t_link as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_tlink),
            "::",
            stringify!(t_link)
        )
    );
}
extern "C" {
    pub fn m0_tlist_init(d: *const m0_tl_descr, list: *mut m0_tl);
}
extern "C" {
    pub fn m0_tlist_fini(d: *const m0_tl_descr, list: *mut m0_tl);
}
extern "C" {
    pub fn m0_tlink_init(d: *const m0_tl_descr, obj: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn m0_tlink_fini(d: *const m0_tl_descr, obj: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn m0_tlink_init_at(
        d: *const m0_tl_descr,
        obj: *mut ::std::os::raw::c_void,
        list: *mut m0_tl,
    );
}
extern "C" {
    pub fn m0_tlink_init_at_tail(
        d: *const m0_tl_descr,
        obj: *mut ::std::os::raw::c_void,
        list: *mut m0_tl,
    );
}
extern "C" {
    pub fn m0_tlink_del_fini(d: *const m0_tl_descr, obj: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn m0_tlist_invariant(d: *const m0_tl_descr, list: *const m0_tl) -> bool;
}
extern "C" {
    pub fn m0_tlist_invariant_ext(
        d: *const m0_tl_descr,
        list: *const m0_tl,
        check: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_void,
            ) -> bool,
        >,
        datum: *mut ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    pub fn m0_tlink_invariant(d: *const m0_tl_descr, obj: *const ::std::os::raw::c_void) -> bool;
}
extern "C" {
    pub fn m0_tlist_is_empty(d: *const m0_tl_descr, list: *const m0_tl) -> bool;
}
extern "C" {
    pub fn m0_tlink_is_in(d: *const m0_tl_descr, obj: *const ::std::os::raw::c_void) -> bool;
}
extern "C" {
    pub fn m0_tlist_contains(
        d: *const m0_tl_descr,
        list: *const m0_tl,
        obj: *const ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    pub fn m0_tlist_length(d: *const m0_tl_descr, list: *const m0_tl) -> size_t;
}
extern "C" {
    #[doc = "Adds an element to the beginning of a list."]
    #[doc = ""]
    #[doc = "@pre !m0_tlink_is_in(d, obj)"]
    #[doc = "@post m0_tlink_is_in(d, obj)"]
    pub fn m0_tlist_add(d: *const m0_tl_descr, list: *mut m0_tl, obj: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[doc = "Adds an element to the end of a list."]
    #[doc = ""]
    #[doc = "@pre !m0_tlink_is_in(d, obj)"]
    #[doc = "@post m0_tlink_is_in(d, obj)"]
    pub fn m0_tlist_add_tail(
        d: *const m0_tl_descr,
        list: *mut m0_tl,
        obj: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = "Adds an element after another element of the list."]
    #[doc = ""]
    #[doc = "@pre !m0_tlink_is_in(d, next)"]
    #[doc = "@post m0_tlink_is_in(d, next)"]
    pub fn m0_tlist_add_after(
        d: *const m0_tl_descr,
        obj: *mut ::std::os::raw::c_void,
        next: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = "Adds an element before another element of the list."]
    #[doc = ""]
    #[doc = "@pre !m0_tlink_is_in(d, next)"]
    #[doc = "@post m0_tlink_is_in(d, next)"]
    pub fn m0_tlist_add_before(
        d: *const m0_tl_descr,
        obj: *mut ::std::os::raw::c_void,
        next: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = "Deletes an element from the list."]
    #[doc = ""]
    #[doc = "@pre   m0_tlink_is_in(d, obj)"]
    #[doc = "@post !m0_tlink_is_in(d, obj)"]
    pub fn m0_tlist_del(d: *const m0_tl_descr, obj: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[doc = "Deletes at element from the list, if it was there."]
    #[doc = ""]
    #[doc = "@post !m0_tlink_is_in(d, obj)"]
    pub fn m0_tlist_remove(d: *const m0_tl_descr, obj: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[doc = "Moves an element from a list to the head of (possibly the same) list."]
    #[doc = ""]
    #[doc = "@pre  m0_tlink_is_in(d, obj)"]
    #[doc = "@post m0_tlink_is_in(d, obj)"]
    pub fn m0_tlist_move(d: *const m0_tl_descr, list: *mut m0_tl, obj: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[doc = "Moves an element from a list to the tail of (possibly the same) list."]
    #[doc = ""]
    #[doc = "@pre  m0_tlink_is_in(d, obj)"]
    #[doc = "@post m0_tlink_is_in(d, obj)"]
    pub fn m0_tlist_move_tail(
        d: *const m0_tl_descr,
        list: *mut m0_tl,
        obj: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = "Returns the first element of a list or NULL if the list is empty."]
    pub fn m0_tlist_head(d: *const m0_tl_descr, list: *const m0_tl) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Removes and returns the head the list or NULL."]
    pub fn m0_tlist_pop(d: *const m0_tl_descr, list: *const m0_tl) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Returns the last element of a list or NULL if the list is empty."]
    pub fn m0_tlist_tail(d: *const m0_tl_descr, list: *const m0_tl) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Returns the next element of a list or NULL if @obj is the last element."]
    #[doc = ""]
    #[doc = "@pre m0_tlist_contains(d, list, obj)"]
    pub fn m0_tlist_next(
        d: *const m0_tl_descr,
        list: *const m0_tl,
        obj: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Returns the previous element of a list or NULL if @obj is the first element."]
    #[doc = ""]
    #[doc = "@pre m0_tlist_contains(d, list, obj)"]
    pub fn m0_tlist_prev(
        d: *const m0_tl_descr,
        list: *const m0_tl,
        obj: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_addb2_mach {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Adds a label to the current context."]
    #[doc = ""]
    #[doc = " @param id    - label identifier"]
    #[doc = " @param n     - number of 64-bit values in label payload"]
    #[doc = " @param value - payload"]
    #[doc = ""]
    #[doc = " Possible uses:"]
    #[doc = ""]
    #[doc = " @code"]
    #[doc = " m0_addb2_add(FOP_FID, 2, fid);"]
    #[doc = " @endcode"]
    #[doc = ""]
    #[doc = " @pre (id & 0xff00000000000000ull) == 0"]
    pub fn m0_addb2_push(id: u64, n: ::std::os::raw::c_int, value: *const u64);
}
extern "C" {
    #[doc = " Removes the top-most label in the current context stack."]
    #[doc = ""]
    #[doc = " @param id - label identifier"]
    #[doc = ""]
    #[doc = " @pre \"id\" must the identifier of the top-most label."]
    #[doc = " @pre (id & 0xff00000000000000ull) == 0"]
    pub fn m0_addb2_pop(id: u64);
}
extern "C" {
    #[doc = " Adds one-time measurement in the current context."]
    #[doc = ""]
    #[doc = " @param id    - measurement identifier"]
    #[doc = " @param n     - number of 64-bit values in measurement payload"]
    #[doc = " @param value - payload"]
    #[doc = ""]
    #[doc = " @pre (id & 0xff00000000000000ull) == 0"]
    pub fn m0_addb2_add(id: u64, n: ::std::os::raw::c_int, value: *const u64);
}
#[doc = " Sensor operations invoked by IMPLEMENTATION."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_addb2_sensor_ops {
    #[doc = " IMPLEMENTATION calls this periodically to read sensor measurements."]
    #[doc = ""]
    #[doc = " \"area\" points to a buffer, where ->so_snapshot() should write out its"]
    #[doc = " payload, no more than m0_addb2_sensor::s_nr elements."]
    pub so_snapshot:
        ::std::option::Option<unsafe extern "C" fn(s: *mut m0_addb2_sensor, area: *mut u64)>,
    #[doc = " Invoked by IMPLEMENTATION when the sensor goes out of context, i.e.,"]
    #[doc = " when the label, which was top-most when the sensor was added, is"]
    #[doc = " popped."]
    pub so_fini: ::std::option::Option<unsafe extern "C" fn(s: *mut m0_addb2_sensor)>,
}
#[test]
fn bindgen_test_layout_m0_addb2_sensor_ops() {
    assert_eq!(
        ::std::mem::size_of::<m0_addb2_sensor_ops>(),
        16usize,
        concat!("Size of: ", stringify!(m0_addb2_sensor_ops))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_addb2_sensor_ops>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_addb2_sensor_ops))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_sensor_ops>())).so_snapshot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_sensor_ops),
            "::",
            stringify!(so_snapshot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_sensor_ops>())).so_fini as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_sensor_ops),
            "::",
            stringify!(so_fini)
        )
    );
}
#[doc = " A sensor is \"always ready\" measurement that IMPLEMENTATION periodically reads"]
#[doc = " out to produce records for CONSUMERS."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_addb2_sensor {
    pub s_ops: *const m0_addb2_sensor_ops,
    #[doc = " Linkage in a list of all sensors associated with a given label."]
    pub s_linkage: m0_tlink,
    #[doc = " Sensor identifier."]
    pub s_id: u64,
    #[doc = " Number of 64-bit elements in sensor payload."]
    pub s_nr: ::std::os::raw::c_uint,
    pub s_magix: u64,
}
#[test]
fn bindgen_test_layout_m0_addb2_sensor() {
    assert_eq!(
        ::std::mem::size_of::<m0_addb2_sensor>(),
        48usize,
        concat!("Size of: ", stringify!(m0_addb2_sensor))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_addb2_sensor>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_addb2_sensor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_sensor>())).s_ops as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_sensor),
            "::",
            stringify!(s_ops)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_sensor>())).s_linkage as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_sensor),
            "::",
            stringify!(s_linkage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_sensor>())).s_id as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_sensor),
            "::",
            stringify!(s_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_sensor>())).s_nr as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_sensor),
            "::",
            stringify!(s_nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_sensor>())).s_magix as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_sensor),
            "::",
            stringify!(s_magix)
        )
    );
}
extern "C" {
    #[doc = " Adds a sensor to the current context. This sensor will be periodically"]
    #[doc = " queried (at the IMPLEMENTATION discretion) until it goes out of context."]
    #[doc = ""]
    #[doc = " \"idx\" is used to specify to which label in the context to add the sensor. -1"]
    #[doc = " means the topmost label, otherwise it is the level of label in the context"]
    #[doc = " (starting from 0)."]
    #[doc = ""]
    #[doc = " @pre context stack must be non-empty."]
    pub fn m0_addb2_sensor_add(
        s: *mut m0_addb2_sensor,
        id: u64,
        nr: ::std::os::raw::c_uint,
        idx: ::std::os::raw::c_int,
        ops: *const m0_addb2_sensor_ops,
    );
}
extern "C" {
    #[doc = " Deletes a sensor."]
    pub fn m0_addb2_sensor_del(s: *mut m0_addb2_sensor);
}
extern "C" {
    #[doc = " Forces current addb2 machine to send its collection of records for"]
    #[doc = " processing (to storage or network), iff it was last sent packing more than"]
    #[doc = " given delay ago."]
    pub fn m0_addb2_force(delay: m0_time_t);
}
extern "C" {
    pub fn m0_addb2_force_all();
}
#[doc = " Machine operations vector provided by SYSTEM."]
#[doc = ""]
#[doc = " @see fop/fom.c:addb2_ops."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_addb2_mach_ops {
    #[doc = " Invoked by IMPLEMENTATION to send a collection of records to network"]
    #[doc = " or storage (at SYSTEM discretion)."]
    #[doc = ""]
    #[doc = " @retval +ve - the trace was accepted for"]
    #[doc = " processing. m0_addb2_trace_done() must be called against this trace"]
    #[doc = " eventually."]
    #[doc = ""]
    #[doc = " @retval 0 - the trace was \"processed instantly\", IMPLEMENTATION is"]
    #[doc = " free to re-use trace after return. Submission errors are included in"]
    #[doc = " this case."]
    #[doc = ""]
    #[doc = " see fop/fom.c:loc_addb2_submit()."]
    pub apo_submit: ::std::option::Option<
        unsafe extern "C" fn(
            mach: *mut m0_addb2_mach,
            tobj: *mut m0_addb2_trace_obj,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Invoked by IMPLEMENTATION to notify SYSTEM that stopped machine"]
    #[doc = " completed its operation and can be finalised."]
    pub apo_idle: ::std::option::Option<unsafe extern "C" fn(mach: *mut m0_addb2_mach)>,
}
#[test]
fn bindgen_test_layout_m0_addb2_mach_ops() {
    assert_eq!(
        ::std::mem::size_of::<m0_addb2_mach_ops>(),
        16usize,
        concat!("Size of: ", stringify!(m0_addb2_mach_ops))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_addb2_mach_ops>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_addb2_mach_ops))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_mach_ops>())).apo_submit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_mach_ops),
            "::",
            stringify!(apo_submit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_mach_ops>())).apo_idle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_mach_ops),
            "::",
            stringify!(apo_idle)
        )
    );
}
extern "C" {
    #[doc = " Notifies the IMPLEMENTATION that the trace has been processed (i.e., sent"]
    #[doc = " across network or stored on storage)."]
    #[doc = ""]
    #[doc = " This is invoked internally from addb2 network and storage components."]
    pub fn m0_addb2_trace_done(trace: *const m0_addb2_trace);
}
extern "C" {
    #[doc = " Allocates and initialises an addb2 machine."]
    #[doc = ""]
    #[doc = " The machine initially has an empty context stack and is immediately ready to"]
    #[doc = " accept m0_addb2_push() and m0_addb2_add() calls. Whenever new record is added"]
    #[doc = " to the machine it is immediately delivered to online CONSUMERS."]
    #[doc = ""]
    #[doc = " The machine accumulates context state and records internally. When amount of"]
    #[doc = " accumulated data reaches some threshold, the machine invokes"]
    #[doc = " m0_addb2_mach_ops::apo_submit() to submit record data to network or storage"]
    #[doc = " (as defined by SYSTEM)."]
    #[doc = ""]
    #[doc = " @param cookie - an opaque pointer, returned by m0_addb2_mach_cookie()."]
    pub fn m0_addb2_mach_init(
        ops: *const m0_addb2_mach_ops,
        cookie: *mut ::std::os::raw::c_void,
    ) -> *mut m0_addb2_mach;
}
extern "C" {
    #[doc = " Finalises a machine."]
    #[doc = ""]
    #[doc = " @pre The machine must be idle."]
    pub fn m0_addb2_mach_fini(mach: *mut m0_addb2_mach);
}
extern "C" {
    #[doc = " Notifies IMPLEMENTATION that SYSTEM wants to shut the machine down."]
    #[doc = ""]
    #[doc = " Once stopped, the machine stops accepting new records and context changes"]
    #[doc = " (appropriate functions become no-ops) and submits all pending record data."]
    #[doc = ""]
    #[doc = " When all pending record data have been processed, the machine becomes idle"]
    #[doc = " and m0_addb2_mach_ops::apo_idle() is invoked. An idle machine can be"]
    #[doc = " finalised."]
    pub fn m0_addb2_mach_stop(mach: *mut m0_addb2_mach);
}
extern "C" {
    #[doc = " Waits until stopped machine becomes idle."]
    pub fn m0_addb2_mach_wait(mach: *mut m0_addb2_mach);
}
extern "C" {
    #[doc = " Returns cookie passed to m0_addb2_mach_init()."]
    #[doc = ""]
    #[doc = " This can be used to associate a machine with some ambient SYSTEM object."]
    pub fn m0_addb2_mach_cookie(mach: *const m0_addb2_mach) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn m0_addb2_module_init() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m0_addb2_module_fini();
}
#[doc = " A trace is a representation of a sequence of addb2 records produced in the"]
#[doc = " same machine."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_addb2_trace {
    pub tr_nr: u64,
    pub tr_body: *mut u64,
}
#[test]
fn bindgen_test_layout_m0_addb2_trace() {
    assert_eq!(
        ::std::mem::size_of::<m0_addb2_trace>(),
        16usize,
        concat!("Size of: ", stringify!(m0_addb2_trace))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_addb2_trace>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_addb2_trace))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_trace>())).tr_nr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_trace),
            "::",
            stringify!(tr_nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_trace>())).tr_body as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_trace),
            "::",
            stringify!(tr_body)
        )
    );
}
#[doc = " A wrapper object used to pass traces to network and storage components."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_addb2_trace_obj {
    #[doc = " Trace itself."]
    pub o_tr: m0_addb2_trace,
    #[doc = " Linkage into networking or storage queues."]
    pub o_linkage: m0_tlink,
    #[doc = " Pointer to the machine in which the trace was generated."]
    pub o_mach: *mut m0_addb2_mach,
    #[doc = " Completion call-back."]
    #[doc = ""]
    #[doc = " This is called by the processing (storage or network) after the trace"]
    #[doc = " has been processed (see frame_done())."]
    #[doc = ""]
    #[doc = " @note If this is not defined, the standard call-back"]
    #[doc = " m0_addb2_trace_done() is invoked."]
    pub o_done: ::std::option::Option<unsafe extern "C" fn(obj: *mut m0_addb2_trace_obj)>,
    #[doc = " Push this trace through to the consumers as soon as possible,"]
    #[doc = "bypassing caches."]
    pub o_force: bool,
    pub o_magix: u64,
}
#[test]
fn bindgen_test_layout_m0_addb2_trace_obj() {
    assert_eq!(
        ::std::mem::size_of::<m0_addb2_trace_obj>(),
        64usize,
        concat!("Size of: ", stringify!(m0_addb2_trace_obj))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_addb2_trace_obj>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_addb2_trace_obj))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_trace_obj>())).o_tr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_trace_obj),
            "::",
            stringify!(o_tr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_trace_obj>())).o_linkage as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_trace_obj),
            "::",
            stringify!(o_linkage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_trace_obj>())).o_mach as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_trace_obj),
            "::",
            stringify!(o_mach)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_trace_obj>())).o_done as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_trace_obj),
            "::",
            stringify!(o_done)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_trace_obj>())).o_force as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_trace_obj),
            "::",
            stringify!(o_force)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_trace_obj>())).o_magix as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_trace_obj),
            "::",
            stringify!(o_magix)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_addb2_counter_data {
    pub cod_nr: u64,
    pub cod_min: i64,
    pub cod_max: i64,
    pub cod_sum: i64,
    pub cod_ssq: u64,
    pub cod_datum: u64,
}
#[test]
fn bindgen_test_layout_m0_addb2_counter_data() {
    assert_eq!(
        ::std::mem::size_of::<m0_addb2_counter_data>(),
        48usize,
        concat!("Size of: ", stringify!(m0_addb2_counter_data))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_addb2_counter_data>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_addb2_counter_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_counter_data>())).cod_nr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_counter_data),
            "::",
            stringify!(cod_nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_counter_data>())).cod_min as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_counter_data),
            "::",
            stringify!(cod_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_counter_data>())).cod_max as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_counter_data),
            "::",
            stringify!(cod_max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_counter_data>())).cod_sum as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_counter_data),
            "::",
            stringify!(cod_sum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_counter_data>())).cod_ssq as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_counter_data),
            "::",
            stringify!(cod_ssq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_counter_data>())).cod_datum as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_counter_data),
            "::",
            stringify!(cod_datum)
        )
    );
}
pub const M0_ADDB2_COUNTER_VALS: ::std::os::raw::c_uint = 6;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_addb2_counter {
    pub co_sensor: m0_addb2_sensor,
    pub co_val: m0_addb2_counter_data,
}
#[test]
fn bindgen_test_layout_m0_addb2_counter() {
    assert_eq!(
        ::std::mem::size_of::<m0_addb2_counter>(),
        96usize,
        concat!("Size of: ", stringify!(m0_addb2_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_addb2_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_addb2_counter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_counter>())).co_sensor as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_counter),
            "::",
            stringify!(co_sensor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_counter>())).co_val as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_counter),
            "::",
            stringify!(co_val)
        )
    );
}
extern "C" {
    pub fn m0_addb2_counter_add(
        counter: *mut m0_addb2_counter,
        label: u64,
        idx: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn m0_addb2_counter_del(counter: *mut m0_addb2_counter);
}
extern "C" {
    pub fn m0_addb2_counter_mod(counter: *mut m0_addb2_counter, val: i64);
}
extern "C" {
    pub fn m0_addb2_counter_mod_with(counter: *mut m0_addb2_counter, val: i64, datum: u64);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_addb2_list_counter {
    pub lc_sensor: m0_addb2_sensor,
    pub lc_list: *mut m0_tl,
}
#[test]
fn bindgen_test_layout_m0_addb2_list_counter() {
    assert_eq!(
        ::std::mem::size_of::<m0_addb2_list_counter>(),
        56usize,
        concat!("Size of: ", stringify!(m0_addb2_list_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_addb2_list_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_addb2_list_counter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_list_counter>())).lc_sensor as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_list_counter),
            "::",
            stringify!(lc_sensor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_list_counter>())).lc_list as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_list_counter),
            "::",
            stringify!(lc_list)
        )
    );
}
extern "C" {
    pub fn m0_addb2_list_counter_add(
        counter: *mut m0_addb2_list_counter,
        list: *mut m0_tl,
        label: u64,
        idx: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn m0_addb2_list_counter_del(counter: *mut m0_addb2_list_counter);
}
extern "C" {
    pub fn m0_addb2_clock_add(clock: *mut m0_addb2_sensor, label: u64, idx: ::std::os::raw::c_int);
}
extern "C" {
    pub fn m0_addb2_clock_del(clock: *mut m0_addb2_sensor);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m0_addb2_local_counter {
    pub lc_id: u64,
    pub lc_key: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_m0_addb2_local_counter() {
    assert_eq!(
        ::std::mem::size_of::<m0_addb2_local_counter>(),
        16usize,
        concat!("Size of: ", stringify!(m0_addb2_local_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<m0_addb2_local_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(m0_addb2_local_counter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_local_counter>())).lc_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_local_counter),
            "::",
            stringify!(lc_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m0_addb2_local_counter>())).lc_key as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m0_addb2_local_counter),
            "::",
            stringify!(lc_key)
        )
    );
}
extern "C" {
    pub fn m0_addb2_local_counter_init(
        lc: *mut m0_addb2_local_counter,
        id: u64,
        counter: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m0_addb2_local_counter_mod(lc: *mut m0_addb2_local_counter, val: u64, datum: u64);
}
#[doc = " Maximal number of 64-bit values in a payload."]
#[doc = ""]
#[doc = " @note this constant cannot really be increased. Trace buffer format"]
#[doc = " assumes that this is less than 0x10."]
pub const VALUE_MAX_NR: ::std::os::raw::c_uint = 15;
#[doc = " Maximal number of 64-bit values in a payload."]
#[doc = ""]
#[doc = " @note this constant cannot really be increased. Trace buffer format"]
#[doc = " assumes that this is less than 0x10."]
pub const FRAME_TRACE_MAX: ::std::os::raw::c_uint = 128;
#[doc = " Maximal number of 64-bit values in a payload."]
#[doc = ""]
#[doc = " @note this constant cannot really be increased. Trace buffer format"]
#[doc = " assumes that this is less than 0x10."]
pub const FRAME_SIZE_MAX: ::std::os::raw::c_uint = 4194304;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
extern "C" {
    pub fn m0_addb2_trace_size(trace: *const m0_addb2_trace) -> m0_bcount_t;
}
extern "C" {
    pub static mut m0_addb2__dummy_payload: [u64; 0usize];
}
extern "C" {
    pub static mut m0_addb2__dummy_payload_size: u64;
}
extern "C" {
    pub static tr_tl: m0_tl_descr;
}
extern "C" {
    pub fn tr_tlist_init(head: *mut m0_tl);
}
extern "C" {
    pub fn tr_tlist_fini(head: *mut m0_tl);
}
extern "C" {
    pub fn tr_tlink_init(amb: *mut m0_addb2_trace_obj);
}
extern "C" {
    pub fn tr_tlist_invariant(head: *const m0_tl) -> bool;
}
extern "C" {
    pub fn tr_tlist_invariant_ext(
        head: *const m0_tl,
        check: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const m0_addb2_trace_obj,
                arg2: *mut ::std::os::raw::c_void,
            ) -> bool,
        >,
        arg1: *mut ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    pub fn tr_tlist_is_empty(list: *const m0_tl) -> bool;
}
extern "C" {
    pub fn tr_tlink_init_at(amb: *mut m0_addb2_trace_obj, head: *mut m0_tl);
}
extern "C" {
    pub fn tr_tlink_init_at_tail(amb: *mut m0_addb2_trace_obj, head: *mut m0_tl);
}
extern "C" {
    pub fn tr_tlink_fini(amb: *mut m0_addb2_trace_obj);
}
extern "C" {
    pub fn tr_tlink_del_fini(amb: *mut m0_addb2_trace_obj);
}
extern "C" {
    pub fn tr_tlink_is_in(amb: *const m0_addb2_trace_obj) -> bool;
}
extern "C" {
